#ifndef GUARD_GLOBAL_H
#define GUARD_GLOBAL_H

//------------------------------------------------------------------------------
// Macros
//------------------------------------------------------------------------------

// Both of these match so far
#define ABS(n) ((n) >= 0 ? (n) : -(n))
//#define ABS(n) ((n) < 0 ? -(n) : (n))

// TODO: find a way to control ordering of BSS symbols within an object file
// The compiler seems to always put global symbols before static symbols
#define GLOBAL_BSS __attribute__((section(".bss_global")))
#define BSS __attribute__((section(".bss")))

#define ARRAY_COUNT(arr) (sizeof(arr)/sizeof((arr)[0]))

//------------------------------------------------------------------------------
// Types
//------------------------------------------------------------------------------

// OamData, but with explicit bit fields for hflip and vflip
struct OamData_alt
{
    /*0x00*/ u32 y:8;
    /*0x01*/ u32 affineMode:2;
             u32 objMode:2;
             u32 mosaic:1;
             u32 bpp:1;
             u32 shape:2;

    /*0x02*/ u32 x:9;
             u32 matrixNum_b0_2:3;
             u32 matrixNum_hflip:1;
             u32 matrixNum_vflip:1;
             u32 size:2;

    /*0x04*/ u16 tileNum:10;
             u16 priority:2;
             u16 paletteNum:4;
    /*0x06*/ u16 affineParam;
};

struct Coords32
{
    s32 x;
    s32 y;
};

struct CmprHeader
{
    u32 reserved:4;
    u32 compressionType:4;  // 1 = LZ77
    u32 size:24;  // size of decompressed data
    // data follows this header
};

struct UnkStruct1_sub_child_data
{
    u8 filler0[4];
    u16 unk4;  // image width?
    u16 unk6;  // image height?
    union { s8 as_s8; s32 as_s32; } unk8;
    union { s8 as_s8; s32 as_s32; } unkC;
    void *unk10;  // pointer to BGxHOFS register?
    void *unk14;  // pointer to BGxVOFS register?
    u8 filler18[8];
    s16 unk20;
    s16 unk22;
    s16 unk24;
    u8 filler26[0x28-0x26];
    // tilemap (with CmprHeader) immediately follows this
};

struct UnkStruct1_sub_child_data68_sub
{
    u32 unk0;
    u32 unk4;  // something to do with VRAM allocation?
    u16 unk8;
    u8 fillerA[2];
};  // size = 0xC

struct UnkStruct1_sub_child_data68
{
    u16 unk0;
    u16 unk2;  // count of unk4 array
    struct UnkStruct1_sub_child_data68_sub unk4[1];
};

struct GraphicsConfig_6C
{
    u16 unk0;
    u16 unk2;
    u8 unk4[0x200];
    u8 unk204[0];
};

struct GraphicsConfig
{
    s32 unk0;  // size of this struct? bit 31 is some flag
    u8 filler4[4];
    /*0x08*/ u32 gfxOffset;  // offset to CmprHeader containing graphics data. Actually 4 bytes ahead of this
    /*0x0C*/ s32 unkOffsets[4];  // offsets to UnkStruct1_sub_child_data structs from the beginning of this struct. Is this tilemap related?
    /*0x1C*/ u32 palOffset;  // offset from the beginning of this struct to palette. Palette is actually 4 bytes after the address.
    u8 filler20[0xC];
    u16 unk2C;
    u16 unk2E;
    /*0x30*/ u16 bldCnt;
    /*0x32*/ u16 bldAlpha;
    /*0x34*/ u16 bldY;
    u8 filler36[2];
    /*0x38*/ u16 bgCnt[4];  // bgcnt for BGs 0-3
    /*0x40*/ u8 *bgVramMapAddrs[4];  // VRAM tile map addresses for each BG?
    /*0x50*/ u8 *vramAddr50[4];  // VRAM addresses?
    u8 filler60[8];
    u32 unk68;  // some offset
    u32 unk6C;  // offset to a GraphicsConfig_6C struct
};

struct UnkStruct1_sub
{
    struct GraphicsConfig *unk0;
    /*0x04*/ u16 bgNum;  // bgNum
    u8 unk6;
    u8 unk7;
};

struct UnkStruct1
{
    struct UnkStruct1_sub unk0[4];
    u8 unk20[4];  // some indices (0 to 3)?
    /*0x24*/ u8 bgPrio[4];  // priorities for each background
    /*0x28*/ void *levelData;
    u8 unk2C;
    u8 unk2D;
    s8 unk2E;
    u8 unk2F;
    u8 unk30;
    u8 unk31;
    u8 unk32;  // some index
    u8 unk33;  // flags: bit 0 = enable blending
};

struct KeyInput
{
    u16 keys:10;
    u16 dummy:6;
};

struct Struct30002B8
{
    s32 unk0;
    s32 unk4;
};

struct Struct30012D0
{
    u8 filler0[6];
    u16 unk6;
};

struct Struct30009B0
{
    s32 unk0;
    s32 unk4;
    u8 unk8;
    s16 unk10;
    s16 unk12;
};

extern struct Struct3000A10 {
    u32 *base;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unk7;
    u8 pad4[0x28];
    u8 unk28;
    u8 unk29;
    u8 unk2A;
    u8 unk2B;
    u8 unk2C;
    u8 padA[0x3];
    u8 unk30;
    u8 unk39;
    u8 unk3A;
    u8 unk3B;
    u32 unk3C;
    u32 unk40;
    u8 unk44;
    u8 pad5[0x35];
    u8 unk7A;
    u8 unk7B;
    u8 unk7C;
    u8 unk7D;
    u8 pad2[0x12];
    u8 unk90;
    u8 unk91;
    u8 unk92;
    u8 pad6[0x43];
    u8 unkD6;
    u16 pad3[0x24];
    u8 unk120;
    u8 unk121;
    u8 unk122;
    u8 unk123;
    u8 unk124;
    u8 unk125;
} unk1;

struct UnknownStruct6
{
    u8 filler0[0x20];
    s32 unk20;
    s32 unk24;
};

struct UnknownStruct5
{
    /*0x00*/ struct GraphicsConfig *backgroundData;
    /*0x04*/ u32 *levelData;
    /*0x08*/ u16 levelTimer;
    /*0x0A*/ u8 songID;
    /*0x0B*/ u8 levelType;
    /*0x0C*/ u32 levelFlags;
    /*0x10*/ u32 unk10;
};

struct UnknownStruct4_child
{
    u8 filler0[6];
    u16 unk6;
};

// These may be the same. Don't know yet.
struct UnknownStruct4
{
    struct UnknownStruct5 *unk0;
    struct GraphicsConfig *unk4;
    struct UnknownStruct4_child *unk8;
    u32 (*unkC)(void);
    s16 unk10;
    s16 unk12;
    u32 unk14;
    u32 unk18;
    u8 filler1C;
    u8 unk1D[3];
    /*0x20*/ u32 levelType;
};


struct UnknownStruct7
{
    u8 filler0[0x34];
    s8 unk34;
};

struct UnknownStruct8
{
    u8 filler0[0x14];
    u32 unk14;
};

struct UnknownStruct10
{
    u8 unk0[4];
    u16 unk4;
    u8 filler6[4];
    u8 unkA;
};

struct UnknownStruct9
{
    const struct UnknownStruct10 *unk0;
    u32 unk4;
    u32 unk8;
    u32 unkC;
    const void *unk10;
    u8 unk14;
    u8 unk15;
    u8 unk16;
    u8 unk17;
    u16 unk18;
    void *unk1C;
    u32 unk20;
    u32 unk24;
    u16 unk28;
};

struct UnknownStruct15_child
{
    u8 filler0[0xA];
    u8 unkA;
    u8 unkB;
    u8 unkC;
    u8 unkD;
};

struct UnknownStruct15
{
    u8 unk0[0x108];
    struct UnknownStruct15_child *unk108[0];
};

struct UnknownStruct17
{
    u8 unk0;
    u8 unk1;
};

struct MovieSoundEffect  // Movie sound effects
{
    /*0x00*/ u32 soundID;  // sound ID
    u8 filler4[2];
    u8 unk6;
    u8 unk7;  // maybe volume related?
    /*0x08*/ u32 startTime;  // start time?
    /*0x0C*/ u32 endTime;  // end time?
};  // size = 0x10

struct Movie_child
{
    u32 unk0;
    u16 unk4;
    struct Movie_child_child8 *unk8;
    u16 unkC;
    struct Movie_child_child10 *unk10;
    /*0x14*/ u16 soundEffectsCount;
    /*0x18*/ struct MovieSoundEffect *soundEffects;
    u16 unk1C;
    struct Movie_child_child20 *unk20;
    u16 unk24;
    struct Movie_child_child28 *unk28;
    u16 unk2C;
    struct Movie_child_child30 *unk30;  // video?
};  // size = 0x34

struct Movie
{
    u16 unk0;
    u8 filler2[2];
    struct Movie_child *unk4;
};

struct MoviePlayerParamaters
{
    struct Movie *movieData;
    u8 unk4;
    u8 songID;
    u8 nextMode;
    u8 movieID;
};

struct backgroundLayerOffset
{
    /*0x00*/ u16 bg0_x;
    /*0x02*/ u16 bg0_y;
    /*0x04*/ u16 bg1_x;
    /*0x06*/ u16 bg1_y;
    /*0x08*/ u16 bg2_x;
    /*0x0A*/ u16 bg2_y;
    /*0x0C*/ u16 bg3_x;
    /*0x0E*/ u16 bg3_y;
};

typedef struct test {
    s16 unk0;
    s16 unk2;
    s16 unk4;
    s16 unk6;
    s16 unk8;
    s16 unkA;
    s32 unkC;
} test;

typedef struct struct_030019AC {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    s32 unk10;
    s32 unk14;
    s32 unk18;
    s32 unk1C;
    s32 unk20;
    s32 unk24;
    s32 unk28;
    s32 unk2C;
    s32 unk30;
    s32 unk34;
    s32 unk38;
    s32 unk3C;
    //s32 unk40;
    u8 filler40[3];
    s8 unk43;
    s32 unk44;
    s32 unk48;
    s32 unk4C;
    s32 unk50;
    s16 unk54;
    s16 unk56;
    s32 unk58;
    s32 unk5C;
    s32 unk60;
    s32 unk64;
    s32 unk68;
    s32 unk6C;
    s32 unk70;
    s32 unk74;
    s32 unk78;
    s32 unk7C;
    s32 unk80;
    test* unk84;
} struct_030019AC;

typedef struct struct_03001BD0 {
    s16 unk0[4];
    s32 unk8;
    s32 unkC;
    s32 unk10;
    s32 unk14;
    s32 unk18;
    s32 unk1C;
    s32 unk20;
    s32 unk24;
    s32 unk28;
    s32 unk2C;
    s32 unk30;
    s32 unk34;
    s32 unk38;
    u8 unk3C;
    u8 unk3D;
} struct_03001BD0;

typedef struct unkst24 {
    u8 pad[0x24];
} unkst24;

struct levelCollectableFlags
{
    u8 redPresent;
    u8 yellowPresent;
    u8 bluePresent;
    u8 letterT;
    u8 letterO;
    u8 letterY;
    u8 unk6;
    u8 unk7;
};

struct worldTableStruct_unk_size_c {
    s32 unk0;
    struct UnknownStruct5 *unk4;
    struct GraphicsConfig *unk8;
};

struct worldTableStruct {
    s32 unk0;
    struct worldTableStruct_unk_size_c *unk4;
};

struct Struct0807C0E0  // Is this supposed to be worldTableStruct?
{
    struct Struct168 *unk0;
    u16 unk4;
    u8 filler6[2];
};  // size = 0x8

struct iwRAMBase {
u32 base[0];
};

struct struct_0807820C_sub8
{
    u32 objectID:16;
    u32 unk2_0:7;
    u32 filler2_7:1;
    u32 unk3:8;
};

struct LevelObject
{
    u16 objectID;
    u8 x;
    u8 y;
};

struct struct_0807820C
{
    u16 backgroundHorizontalShift;
    u16 backgroundVerticalShift;
    u16 levelWidthPixels;
    u16 levelHeightPixels;
    u16 unk8;
    u16 unkA;
    struct LevelObject unkC[1];
    u8 filler10[0x400C-0x10];
    u16 unk400C[0x1000];
    u16 unk600C[0x1000];
    u16 unk800C[0x2000];
    u32 unkC00C;
};

enum SoundID
{
    SE_CLIMB          = 0,
    SE_SKID           = 1,
    SE_POUND          = 2,
    SE_TUMBLE1        = 3,
    SE_STUN           = 4,
    SE_BURN1          = 5,
    SE_JUMP_1         = 6,
    SE_GRUNT2         = 7,
    SE_JUMP_4         = 8,
    SE_JUMP_3         = 9,
    SE_PICKUP         = 10,
    SE_JUMP_5         = 11,
    SE_COUNTER        = 12,
    SE_ITEM1          = 13,
    SE_STEPS2         = 14,
    SE_KEY1           = 15,
    SE_CRASH          = 16,
    SE_THROW          = 17,
    SE_WALK           = 18,
    SE_PICKUP_CRYSTAL = 19,
    SE_HERE_WEGO      = 20,  // "Okey-dokey! Let's a-go!"
    SE_LETS_GO        = 21,  // "Let's a-go, you guys!"
    SE_BACK           = 22,
    SE_CURSOR_E       = 23,
    SE_CURSOR_M       = 24,
    SE_CURSOR_S       = 25,
    SE_ERASE          = 26,
    SE_ERROR          = 27,
    SE_EXIT_ED        = 28,
    SE_FIELD          = 29,
    SE_GRID           = 30,
    SE_ITEM           = 31,
    SE_SELECT_M       = 32,
    SE_SELECT_S       = 33,
    SE_STAMP          = 34,
    SE_START          = 35,
    SE_BEAM           = 36,
    SE_BURN2          = 37,
    SE_BLOCK          = 38,
    SE_EXIT           = 39,
    SE_HURT           = 40,
    SE_ITEMLAST       = 41,
    SE_POUND2         = 42,
    SE_SCUFF          = 43,
    SE_SHOCK          = 44,
    SE_KEY_DOOR       = 45,
    SE_SPIN           = 46,
    SE_SPLAT          = 47,
    SE_SQUEAK         = 48,
    SE_UNLOCK         = 49,
    SE_WIREJUMP       = 50,
    SE_SPIN_1         = 51,
    SE_ONE_UP         = 52,
    SE_HELP           = 53,
    SE_SILENCE        = 54,
    SE_SKIDSHORT      = 55,
    SE_SWITCH1        = 56,
    SE_SWITCH2        = 57,
    SE_SWITCH3        = 58,
    SE_BOING          = 59,
    SE_JUMP_6         = 60,
    SE_ROPE_UP        = 61,
    SE_ROPE_DOWN      = 62,
    SE_DOOR           = 63,
    SE_SCROLL         = 64,
    SE_RETURN         = 65,
    SE_BLANK          = 66,
    SE_LOOK_UP        = 67,
    SE_MM_DIE         = 68,
    SE_MM_BOING       = 69,
    SE_MM_PROTECT     = 70,
    SE_CHEST_OPEN     = 71,
    SE_CHEST_CLOSE    = 72,
    SE_OOF            = 73,
    SE_DK_HURT        = 74,
    SE_DK_BELLOW      = 75,
    SE_SLAM2          = 76,
    SE_FRUIT_FALL     = 77,
    SE_POINTER        = 78,
    SE_CHOOSE         = 79,
    SE_EMPTY          = 80,
    SE_TOY1           = 81,
    SE_TOYLAST        = 82,
    SE_WARP_OUT       = 83,
    SE_WARP_IN        = 84,
    SE_SQUEEZE        = 85,
    SE_GLASS          = 86,
    SE_LIFT           = 87,
    SE_MM_OH_NO       = 88,
    SE_JUMP_7         = 89,
    SE_LEVEL_START    = 90,
    SE_ELEV_GO        = 91,
    SE_ELEV_STOP      = 92,
    SE_EGG_FALL       = 93,
    SE_DK_EXIT1       = 94,
    SE_DK_BLUBBER     = 95,
    SE_MOVIE_02       = 96,
    SE_MOVIE_03       = 97,
    SE_MOVIE_04       = 98,
    SE_MOVIE_05       = 99,
    SE_MOVIE_06       = 100,
    SE_KEY2           = 101,
    SE_KEY3           = 102,
    SE_GRAB_WIRE      = 103,
    SE_GRAB_ROPE      = 104,
    SE_GRAB_LADDER    = 105,
    SE_CRUSH          = 106,
    SE_SPITFIRE       = 107,
    SE_NINJI          = 108,
    SE_CRUMBLE        = 109,
    SE_LAVA           = 110,
    SE_BUBBLE         = 111,
    SE_FOUNTAIN       = 112,
    SE_OUCH           = 113,
    SE_RESTART        = 114,
    SE_METALROLL      = 115,
    SE_SHWING         = 116,
    SE_KICK           = 117,
    SE_BRICKMAN       = 118,
    SE_SPIT           = 119,
    SE_POP            = 120,
    SE_GROWL          = 121,
    SE_GROWL2         = 122,
    SE_GHOST          = 123,
    SE_SHY_WAKE       = 124,
    SE_SHY_RUN        = 125,
    SE_BOMB_PEEP      = 126,
    SE_BOMB_JUMP      = 127,
    SE_BOMB_FLASH     = 128,
    SE_BOMB_BLOW      = 129,
    SE_VAPORIZE       = 130,
    SE_BAT            = 131,
    SE_CANNON         = 132,
    SE_CROUCH         = 133,
    SE_SCATTER        = 134,
    SE_REACH          = 135,
    SE_DK_HEAD        = 136,
    SE_GOTCHA         = 137,
    SE_TOAD_WALK      = 138,
    SE_TOAD_TOSS      = 139,
    SE_BOX_FALL       = 140,
    SE_SPARKY_LOOP    = 141,
    SE_DK_BLUB        = 142,
    SE_YANK           = 143,
    SE_SPIKE          = 144,
    SE_BONE           = 145,
    SE_MM_BOINGUP     = 146,
    SE_LASER          = 147,
    SE_DK_JUMP        = 148,
    SE_JUMP_8         = 149,
    SE_TRASHCAN       = 150,
    SE_KEY_TOAD       = 151,
    SE_SHATTER        = 152,
    SE_TOAD_CARRY     = 153,
    SE_TOAD_SET       = 154,
    SE_JUMP_A         = 155,
    SE_JUMP_B         = 156,
    SE_JUMP_C         = 157,
    SE_JUMP_D         = 158,
    SE_SHUFFLE        = 159,
    SE_MOVIE_07       = 160,
    SE_MOVIE_01       = 161,
    SE_MINI_KEY       = 162,
    SE_MOVIE2_1       = 163,
    SE_MOVIE2_2       = 164,
    SE_MOVIE2_3       = 165,
    SE_MOVIE2_4       = 166,
    SE_MOVIE2_5       = 167,
    SE_MOVIE2_6       = 168,
    SE_MOVIE2_7       = 169,  // "Hey! Come back here!"
    SE_MOVIE2_8       = 170,
    SE_BOSS_ARM       = 171,
    SE_BOSS_ARM2      = 172,
    SE_BOSS_ARM3      = 173,
    SE_BOSS_ARM4      = 174,
    SE_BOSS_ARM5      = 175,
    SE_BOSS_SWITCH    = 176,
    SE_CURSOR_WORLD   = 177,
    SE_CURSOR_UP_DN   = 178,
    SE_BOSS_DIE1      = 179,
    SE_BOSS_DIE2      = 180,
    SE_BOSS_INTRO1    = 181,
    SE_BOSS_INTRO3    = 182,
    SE_PLUS_MAIN      = 183,
    SE_BARREL         = 184,
    SE_SPIKE_HIT      = 185,
    SE_BIGBARREL_HIT  = 186,
    SE_BIGBARREL_FALL = 187,
    SE_TOADS_JUMP     = 188,
    SE_TOADS_GRAB     = 189,
    SE_MOVIE3_01      = 190,
    SE_MOVIE3_02      = 191,
    SE_MOVIE3_03      = 192,
    SE_MOVIE3_04      = 193,
    SE_MOVIE3_05      = 194,
    SE_MOVIE3_06      = 195,
    SE_MOVIE3_07      = 196,
    SE_MOVIE3_08      = 197,
    SE_MOVIE3_09      = 198,
    SE_MOVIE3_10      = 199,
    SE_MOVIE3_11      = 200,
    SE_MOVIE3_12      = 201,
    SE_MOVIE3_13      = 202,
    SE_MOVIE3_14      = 203,
    SE_MOVIE4_01      = 204,
    SE_MOVIE4_02      = 205,
    SE_MOVIE4_03      = 206,
    SE_MOVIE4_04      = 207,
    SE_MOVIE4_06      = 208,
    SE_MOVIE4_07      = 209,
    SE_MOVIE4_08      = 210,
    SE_MOVIE4_09      = 211,  // "Stop! Not again?"
    SE_MOVIE4_10      = 212,  // "Here we go again! Hoo-hooo!"
    SE_MOVIE5_01      = 213,  // "Come back here, you big monkey!"
    SE_MOVIE5_05      = 214,  // "Oh?"
    SE_MOVIE5_07      = 215,  // "Here we go! Again? Again?"
    SE_MOVIE6_01      = 216,  // DK crying
    SE_MOVIE6_02      = 217,
    SE_MOVIE6_03      = 218,  // "Ohh you mum-mummy, you (Italian gibberish)!"
    SE_MOVIE6_04      = 219,
    SE_MOVIE6_05      = 220,  // "Hey, it's okay. Don't cry."
    SE_MOVIE6_06      = 221,  // "Here, you like?"
    SE_MOVIE6_07      = 222,  // "It's a mini Mario."
    SE_MOVIE6_08      = 223,
    SE_MOVIE6_09      = 224,
    SE_MOVIE6_10      = 225,
    SE_MOVIE2_9       = 226,
    SE_MOVIE2_10      = 227,
    SE_MOVIE_08       = 228,
    SE_TITLE          = 229,  // "Mario vs. Donkey Kong!"
    SE_YOU_WON1       = 230,
    SE_YOU_WON2       = 231,
    SE_YOU_WON3       = 232,
    SE_STAR           = 233,
    SE_DK_WALK        = 234,
    SE_SCUFF2         = 235,
    SE_WORLD_START    = 236,  // "Let's a-get going!"
    SE_MM_WAKEUP      = 237,
    SE_MM_FREE        = 238,
    SE_MM_MAMAMIAS    = 239,
    SE_SPIKE_VANISH   = 240,
    SE_SPIKE_APPEAR   = 241,
    SE_BOSS_DIE3      = 242,
    SE_BARREL_BOUNCE  = 243,
    SE_ROCK_BOUNCE    = 244,
    SE_MM_WALK        = 245,
    SE_DK_GRUNT       = 246,
    SE_RIBBON         = 247,
    SE_WON_TEXT       = 248,
    SE_DK_FALL        = 249,
};

enum SpriteID  // Index of sprites in gUncompressedGraphicsTable
{
    SPRITE_ID_DK_WORLD_INTRO = 241,
    SPRITE_ID_MARIO_STAND    = 727,
    SPRITE_ID_MARIO_RUN      = 737,
};

struct UnknownStruct13
{
    //u8 filler0[4];
    u32 unk0;
    u32 unk4;
};

struct UnknownStruct11
{
    u8 filler0[0x1000];
    u32 unk1000;
    u8 filler1004;
    struct UnknownStruct13 *unk1008;
};

struct UnknownStruct12
{
    u32 unk0_0:5;
    //u32 unk0_3:2;
    u32 unk0_5:1;
};

enum LevelType
{
    LEVEL_TYPE_MAIN,
    LEVEL_TYPE_PLUS,
    LEVEL_TYPE_EXPERT_1_6,
    LEVEL_TYPE_EXPERT_7_12,
    LEVEL_TYPE_MAIN_BOSS,
    LEVEL_TYPE_PLUS_BOSS,
};

enum
{
    LOAD_BG_PALETTE = (1 << 0),
    LOAD_OBJ_PALETTE = (1 << 1),
};

struct SubSpriteTemplate
{
    /*0x00*/ u8 index;  // index into sprite sheet?
    /*0x01*/ u8 duration;  // animation frame duration
    /*0x02*/ s8 x_offset;  // x offset from sprite position
    /*0x03*/ s8 y_offset;  // y offset from sprite position
    u8 filler4[4];
    u32 unk8;  // some kind of flags?
    void *unkC;
    u8 filler10[0x24-0x10];
};

struct SpriteTemplate
{
    /*0x00*/ u16 x;  // might actually be the number of subsprites instead?
    /*0x02*/ u16 y;
    u16 unk4;
    u16 unk6;  // number of tiles used? not sure...
    /*0x08*/ u16 subSpriteSize;  // size of each sprite's tile data
    /*0x0C*/ struct SubSpriteTemplate *subSprites;
    /*0x10*/ struct OamData *oamData;  // oam
    /*0x14*/ u8 *tileData;  // tile data
};  // size = 0x18

// header to some data
// full size is unkB * gUnknown_03000170.unk18
struct SomeUnknownHeader
{
    u8 filler0[0xB];
    u8 unkB;
    u8 unkC;
};

// header for UnknownListThing2 and StructC40_child
struct LinkedListHeaderMaybe
{
    u32 unk0;
    union
    {
        u32 as_u32;
        struct
        {
            u8 unk0;
            u16 unk2;
        } as_struct;
    } unk4;
    struct LinkedListHeaderMaybe *unk8;
};  // size = 0xC

struct LinkedListHeaderMaybe_alt  // should be LinkedListHeaderMaybe?
{
    s32 unk0;
    union
    {
        u32 as_u32;
        struct
        {
            u8 unk0;
            u16 unk2;
        } as_struct;
    } unk4;
    struct LinkedListHeaderMaybe *unk8;
};  // size = 0xC

struct UnknownListThing1
{
    struct LinkedListHeaderMaybe header;
    u8 unkC;
};  // size = 0x10

struct UnknownListThing2
{
    struct LinkedListHeaderMaybe header;
    void *unkC;
};  // size = 0x10

struct Struct170_sub
{
    struct SomeUnknownHeader *unk0;
    struct SomeUnknownHeader *unk4;  // next one after unk0
};  // size = 0x8

struct Struct170
{
    struct Struct170_sub unk0[3];
    u32 unk18;  // size of something
    struct LinkedListHeaderMaybe *unk1C;  // array of 12 LinkedListHeaderMaybe structs
    s32 unk20;
};

struct StructC30
{
    u32 unk0;
    struct UnknownListThing2 *unk4;
};

struct StructC40_sub
{
    void *unk0;
    u8 *unk4;
};

struct StructC40
{
    struct StructC40_sub unk0[1];
    u8 filler0[4];
    u8 fillerC[0x18-0xC];
    u32 unk18;
    u32 unk1C;
    struct LinkedListHeaderMaybe *unk20;  // array
};

struct StructC70
{
    void *unk0;
    u32 unk4;
    void *unk8;
    void *unkC;
    u8 filler10[0x4];
    void *unk14;
    u32 unk18;
};

struct StructC90_child14
{
    u32 unk0;
    u32 unk4;
    u8 filler8[4];
    u16 unkC;
    u8 fillerE[2];
};  // size = 0x10

struct StructC90
{
    /*0x00*/ void *copyDest;
    /*0x04*/ void *copySrc;
    u16 unk8;
    /*0x0A*/ u16 copyLength;
    void *unkC[2];
    struct StructC90_child14 *unk14;
    /*0x18*/ void (*armFunc)(struct StructC90 *, struct StructC70 *, void *, int);  // pointer to some ARM function loaded into RAM
};

struct Struct0802C1C0
{
    u8 filler0[8];
    /*0x08*/ void *bgPalSrc;
    /*0x0C*/ void *objPalSrc;
    u8 filler10[2];
    u16 unk12;
};

struct StructCB0_child
{
    void (*unk0)(struct Struct0802C1C0 *);
    u8 unk4;
    struct StructCB0_child *unk8;
    /*0x0C*/ struct StructCB0_child *next;
    struct Struct0802C1C0 *unk10;
};

struct StructCB0
{
    struct StructCB0_child unk0[5];
    u32 unk64;  // count of unk0 structs
    struct StructCB0_child *unk68;
    struct StructCB0_child *unk6C;
};

struct StructD20
{
    void *unk0[1][2];
    void *unk8;
    void *unkC;
    u16 unk10;
    u16 unk12;
};

struct StructD78
{
    s32 unk0;
    s32 unk4;
    s16 unk8;
    s16 unkA;
    u16 unkC;
    u16 unkE;
    u8 unk10[0x18-0x10];
};  // size = 0x18

struct StructD7C
{
    u8 filler0[0x20];
    s32 unk20;
    s32 unk24;
    u8 filler28[0xB0-0x28];
};  // size = 0xB0

struct Struct802C31C
{
    u32 unk0;
    u32 unk4;
};  // size = 0x8

struct Struct08078210_sub
{
    u8 filler0[2];
    u16 unk2;
    u8 unk4;
};

struct Struct168
{
    u16 unk0;
    u16 unk2;
    u16 unk4;
    u16 unk6;
};

enum PaletteID
{
    PALETTE_0_TITLE_SCREEN,
    PALETTE_1_MAIN_MENU,
    PALETTE_2_EXPERT_LEVELS,
    PALETTE_3_OPTIONS_MENU,
    PALETTE_4,
