#ifndef GUARD_GLOBAL_H
#define GUARD_GLOBAL_H

//------------------------------------------------------------------------------
// Macros
//------------------------------------------------------------------------------

// Both of these match so far
#define ABS(n) ((n) >= 0 ? (n) : -(n))
//#define ABS(n) ((n) < 0 ? -(n) : (n))

// TODO: find a way to control ordering of BSS symbols within an object file
// The compiler seems to always put global symbols before static symbols
#define GLOBAL_BSS __attribute__((section(".bss_global")))
#define BSS __attribute__((section(".bss")))

#define ARRAY_COUNT(arr) (sizeof(arr)/sizeof((arr)[0]))

//#if __STDC_VERSION__ >= 201112L
#if 0
// The C11 way
#define static_assert(cond, msg) _Static_assert(cond, #msg)
#else
// The old, hacky way
#define static_assert(cond, msg) typedef char static_assertion_##msg[(cond)?1:-1]
#endif

// Modern GNU assembler pads code sections with nop by default.
// Use this at the end of a file to pad with zero instead to match the
// original behavior.
#define FILE_PAD asm(".balign 4, 0");

//------------------------------------------------------------------------------
// Types
//------------------------------------------------------------------------------

// OamData, but with explicit bit fields for hflip and vflip
struct OamData_alt
{
    /*0x00*/ u32 y:8;
    /*0x01*/ u32 affineMode:2;
             u32 objMode:2;
             u32 mosaic:1;
             u32 bpp:1;
             u32 shape:2;

    /*0x02*/ u32 x:9;
             u32 matrixNum_b0_2:3;
             u32 matrixNum_hflip:1;
             u32 matrixNum_vflip:1;
             u32 size:2;

    /*0x04*/ u16 tileNum:10;
             u16 priority:2;
             u16 paletteNum:4;
    /*0x06*/ u16 affineParam;
};

struct Coords32
{
    s32 x;
    s32 y;
};

struct CmprHeader
{
    u32 reserved:4;
    u32 compressionType:4;  // 1 = LZ77
    u32 size:24;  // size of decompressed data
    // data follows this header
};

struct UnkStruct1_sub_child_data
{
    u8 filler0[4];
    u16 unk4;  // image width?
    u16 unk6;  // image height?
    union { s8 as_s8; s32 as_s32; } unk8;
    union { s8 as_s8; s32 as_s32; } unkC;
    void *unk10;  // pointer to BGxHOFS register?
    void *unk14;  // pointer to BGxVOFS register?
    u8 filler18[8];
    s16 unk20;
    s16 unk22;
    s16 unk24;
    u8 filler26[0x28-0x26];
    // tilemap (with CmprHeader) immediately follows this
};

struct UnkStruct1_sub_child_data68_sub
{
    u32 unk0;
    u32 unk4;  // something to do with VRAM allocation?
    u16 unk8;
    u8 fillerA[2];
};  // size = 0xC

struct UnkStruct1_sub_child_data68
{
    u16 unk0;
    u16 unk2;  // count of unk4 array
    struct UnkStruct1_sub_child_data68_sub unk4[1];
};

struct GraphicsConfig_6C
{
    u16 unk0;
    u16 unk2;
    u8 unk4[0x200];
    u8 unk204[0];
};

struct GraphicsConfig
{
    s32 unk0;  // size of this struct? bit 31 is some flag
    u8 filler4[4];
    /*0x08*/ u32 gfxOffset;  // offset to CmprHeader containing graphics data. Actually 4 bytes ahead of this
    /*0x0C*/ s32 unkOffsets[4];  // offsets to UnkStruct1_sub_child_data structs from the beginning of this struct. Is this tilemap related?
    /*0x1C*/ u32 palOffset;  // offset from the beginning of this struct to palette. Palette is actually 4 bytes after the address.
    u8 filler20[0xC];
    u16 unk2C;
    u16 unk2E;
    /*0x30*/ u16 bldCnt;
    /*0x32*/ u16 bldAlpha;
    /*0x34*/ u16 bldY;
    u8 filler36[2];
    /*0x38*/ u16 bgCnt[4];  // bgcnt for BGs 0-3
    /*0x40*/ u8 *bgVramMapAddrs[4];  // VRAM tile map addresses for each BG?
    /*0x50*/ u8 *vramAddr50[4];  // VRAM addresses?
    u8 filler60[8];
    u32 unk68;  // some offset
    u32 unk6C;  // offset to a GraphicsConfig_6C struct
};

struct UnkStruct1_sub
{
    struct GraphicsConfig *unk0;
    /*0x04*/ u16 bgNum;  // bgNum
    u8 unk6;
    u8 unk7;
};

struct UnkStruct1
{
    struct UnkStruct1_sub unk0[4];
    u8 unk20[4];  // some indices (0 to 3)?
    /*0x24*/ u8 bgPrio[4];  // priorities for each background
    /*0x28*/ void *levelData;
    u8 unk2C;
    u8 unk2D;
    s8 unk2E;
    u8 unk2F;
    u8 unk30;
    u8 unk31;
    u8 unk32;  // some index
    u8 unk33;  // flags: bit 0 = enable blending
};

struct KeyInput
{
    u16 keys:10;
    u16 dummy:6;
};

struct Struct30002B8
{
    s32 unk0;
    s32 unk4;
};

struct Struct30012D0
{
    u8 filler0[6];
    u16 unk6;
};

struct Struct30009B0
{
    s32 unk0;
    s32 unk4;
    u8 unk8;
    s16 unk10;
    s16 unk12;
};

struct Struct3000A10
{
    u32 *base;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unk7;
    u8 pad4[0x28];
    u8 unk28;
    u8 unk29;
    u8 unk2A;
    u8 unk2B;
    u8 unk2C;
    u8 unk2D;
    u8 unk2E;
    u8 unk2F;
    u8 unk30;
    u8 unk39;
    u8 unk3A;
    u8 unk3B;
    u32 unk3C;
    u32 unk40;
    u8 unk44;
    u8 pad5[0x35];
    u8 unk7A;
    u8 unk7B;
    u8 unk7C;
    u8 unk7D;
    u8 pad2[0x12];
    u8 unk90;
    u8 unk91;
    u8 unk92;
    u8 filler93[0xB6-0x93];
    u8 unkB6;
    u8 fillerB7[0xD6-0xB7];
    //u8 pad6[0x43];
    u8 unkD6;
    u16 pad3[0x24];
    u8 unk120;
    u8 unk121;
    u8 unk122;
    u8 unk123;
    u8 unk124;
    u8 unk125;
};

struct UnknownStruct6
{
    u8 filler0[0x20];
    s32 unk20;
    s32 unk24;
};

struct UnknownStruct5
{
    /*0x00*/ struct GraphicsConfig *backgroundData;
    /*0x04*/ u32 *levelData;
    /*0x08*/ u16 levelTimer;
    /*0x0A*/ u8 songID;
    /*0x0B*/ u8 levelType;
    /*0x0C*/ u32 levelFlags;
    /*0x10*/ u32 unk10;
};

struct Struct0807C0E0  // Is this supposed to be worldTableStruct?
{
    struct Struct168 *unk0;
    u16 unk4;
    u16 unk6;
//    u8 filler6[2];
};  // size = 0x8

struct UnknownStruct4_child
{
    u8 filler0[6];
    u16 unk6;
};

// These may be the same. Don't know yet.
struct UnknownStruct4
{
    struct UnknownStruct5 *unk0;
    struct GraphicsConfig *unk4;
    struct Struct0807C0E0 *unk8;
    void (*unkC)(void);  // camera callback? (for panning background)
    s16 unk10;
    s16 unk12;
    void *unk14;  // BGM data
    u32 unk18;  // BGM volume
    u8 filler1C;
    u8 unk1D[3];
    /*0x20*/ u32 levelFlags;
};


struct UnknownStruct7
{
    u8 filler0[0x34];
    s8 unk34;
};

struct UnknownStruct8
{
    u8 filler0[4];
    u32 unk4;
    u8 filler8[0x14-0x8];
    u32 unk14;
};

struct UnknownStruct10
{
    u8 unk0[4];
    u16 unk4;
    u8 filler6[4];
    u8 unkA;
};

struct UnknownStruct9
{
    const struct UnknownStruct10 *unk0;
    u32 unk4;
    u32 unk8;
    u32 unkC;
    const void *unk10;
    u8 unk14;
    u8 unk15;
    u8 unk16;
    u8 unk17;
    u16 unk18;
    void *unk1C;
    u32 unk20;
    u32 unk24;
    u16 unk28;
};

struct UnknownStruct15_child
{
    u8 filler0[0xA];
    u8 unkA;
    u8 unkB;
    u8 unkC;
    u8 unkD;
};

struct UnknownStruct15
{
    u8 unk0[0x108];
    struct UnknownStruct15_child *unk108[(0x168-0x108)/4];
    u32 unk168;
    u8 filler16C[4];
    u32 unk170;
};

struct UnknownStruct17
{
    u8 unk0;
    u8 unk1;
};

struct MovieSoundEffect  // Movie sound effects
{
    /*0x00*/ u32 soundID;  // sound ID
    u8 filler4[2];
    u8 unk6;
    u8 unk7;  // maybe volume related?
    /*0x08*/ u32 startTime;  // start time?
    /*0x0C*/ u32 endTime;  // end time?
};  // size = 0x10

struct Movie_child
{
    u32 unk0;
    u16 spriteCount;
    struct MovieSpriteTable *movieSprite;
    u16 unkC;
    struct Movie_child_child10 *unk10;
    /*0x14*/ u16 soundEffectsCount;
    /*0x18*/ struct MovieSoundEffect *soundEffects;
    u16 unk1C;
    struct Movie_child_child20 *unk20;
    u16 textBankCount;
    struct MovieTextBank *textBank;
    u16 sceneCount;
    struct MovieSceneBank *sceneBank;  // video?
};  // size = 0x34

enum
{
    //Movies
    MOVIE_INTRO = 0,
    MOVIE_INTRO2 = 1,
    MOVIE_DK_BOSS_1 = 2,
    MOVIE_CREDITS_1 = 3,
    MOVIE_DK_BOSS_1_END = 4,
    MOVIE_DK_BOSS_2 = 5,
    MOVIE_DK_BOSS_2_END = 6,
    MOVIE_CREDITS_2 = 7,
    MOVIE_UNUSED_1 = 8,
    MOVIE_UNUSED_2 = 9,
};

enum  // Movie player flags
{
    MOVIE_PLAYER_ALLOW_SKIP = (1 << 0),
    MOVIE_PLAYER_FLAG_2 = (1 << 1),
};

struct Movie
{
    u16 unk0;
    struct Movie_child *unk4;
};

struct MoviePlayerParamaters
{
    struct Movie *movieData;
    u8 flags;
    u8 songID;
    u8 nextMode;
    u8 movieID;
};

enum // World IDs 
{
	WORLD_1 = 0,
	WORLD_2 = 1,
	WORLD_3 = 2,
	WORLD_4 = 3,
	WORLD_5 = 4,
	WORLD_6 = 5,
};

enum  // Level flags
{
    LEVEL_FLAG_NONE = 0,
    LEVEL_FLAG_1 = (1 << 0),
    LEVEL_FLAG_2 = (1 << 1),
    LEVEL_FLAG_3 = (1 << 2),
    LEVEL_FLAG_4 = (1 << 3),
    LEVEL_FLAG_BG0_SPECIAL = (1 << 4), // Used for the lava geysers in level 3-1A, 3-1B, used for the lava in 3-DK, 3-DK+
    LEVEL_FLAG_ITEM_1 = (1 << 5), // Red present
    LEVEL_FLAG_ITEM_2 = (1 << 6), // Yellow present
    LEVEL_FLAG_ITEM_3 = (1 << 7), // Blue present

    // Unused flags, level flags are 4 bytes big, reads all 4 bytes
    LEVEL_FLAG_9 = (1 << 8), // used in dk_boss_level_setup as part of gNextLevelInLevelTable.levelFlags
    LEVEL_FLAG_10 = (1 << 9), // used in dk_boss_plus_level_setup as part of gNextLevelInLevelTable.levelFlags
    LEVEL_FLAG_11 = (1 << 10), // used in expert_7_12_level_setup as part of gNextLevelInLevelTable.levelFlags
    LEVEL_FLAG_12 = (1 << 11),
    LEVEL_FLAG_13 = (1 << 12),
    LEVEL_FLAG_14 = (1 << 13),
    LEVEL_FLAG_15 = (1 << 14),
    LEVEL_FLAG_16 = (1 << 15),

    LEVEL_FLAG_17 = (1 << 16),
    LEVEL_FLAG_18 = (1 << 17),
    LEVEL_FLAG_19 = (1 << 18),
    LEVEL_FLAG_20 = (1 << 19),
    LEVEL_FLAG_21 = (1 << 20),
    LEVEL_FLAG_22 = (1 << 21),
    LEVEL_FLAG_23 = (1 << 22),
    LEVEL_FLAG_24 = (1 << 23),

    LEVEL_FLAG_25 = (1 << 24),
    LEVEL_FLAG_26 = (1 << 25),
    LEVEL_FLAG_27 = (1 << 26),
    LEVEL_FLAG_28 = (1 << 27),
    LEVEL_FLAG_29 = (1 << 28),
    LEVEL_FLAG_30 = (1 << 29),
    LEVEL_FLAG_31 = (1 << 30),
    LEVEL_FLAG_32 = (1 << 31),
};

struct backgroundLayerOffset
{
    /*0x00*/ u16 bg0_x;
    /*0x02*/ u16 bg0_y;
    /*0x04*/ u16 bg1_x;
    /*0x06*/ u16 bg1_y;
    /*0x08*/ u16 bg2_x;
    /*0x0A*/ u16 bg2_y;
    /*0x0C*/ u16 bg3_x;
    /*0x0E*/ u16 bg3_y;
};

typedef struct test {
    s16 unk0;
    s16 unk2;
    s16 unk4;
    s16 unk6;
    s16 unk8;
    s16 unkA;
    s32 unkC;
} test;

typedef struct struct_030019AC {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    s32 unk10;
    s32 unk14;
    s32 unk18;
    s32 unk1C;
    s32 unk20;
    s32 unk24;
    s32 unk28;
    s32 unk2C;
    s32 unk30;
    s32 unk34;
    s32 unk38;
    s32 unk3C;
    //s32 unk40;
    u8 filler40[3];
    s8 unk43;
    s32 unk44;
    s32 unk48;
    s32 unk4C;
    s32 unk50;
    s16 unk54;
    s16 unk56;
    s32 unk58;
    s32 unk5C;
    s32 unk60;
    s32 unk64;
    s32 unk68;
    s32 unk6C;
    s32 unk70;
    s32 unk74;
    s32 unk78;
    s32 unk7C;
    s32 unk80;
    test* unk84;
} struct_030019AC;

typedef struct struct_03001BD0 {
    s16 unk0[4];
    s32 unk8;
    s32 unkC;
    s32 unk10;
    s32 unk14;
    s32 unk18;
    s32 unk1C;
    s32 unk20;
    s32 unk24;
    s32 unk28;
    s32 unk2C;
    s32 unk30;
    s32 unk34;
    s32 unk38;
    u8 unk3C;
    u8 unk3D;
} struct_03001BD0;

typedef struct unkst24 {
    u8 pad[0x24];
} unkst24;

struct LevelItems
{
    u8 redPresent;
    u8 yellowPresent;
    u8 bluePresent;
    u8 letterT;
    u8 letterO;
    u8 letterY;
    u8 unk6;
    u8 unk7;
};

struct worldTableStruct_unk_size_c {
    s32 unk0;
    struct UnknownStruct5 *unk4;
    struct GraphicsConfig *unk8;
};

struct worldTableStruct {
    s32 unk0;
    struct worldTableStruct_unk_size_c *unk4;
};

struct iwRAMBase {
u32 base[0];
};

struct struct_0807820C_sub8
{
    u32 objectID:16;
    u32 unk2_0:7;
    u32 filler2_7:1;
    u32 unk3:8;
};

struct LevelObject
{
    u16 objectID;
    u8 x;
    u8 y;
};

struct struct_0807820C
{
    u16 backgroundHorizontalShift;
    u16 backgroundVerticalShift;
    u16 levelWidthPixels;
    u16 levelHeightPixels;
    u16 unk8;
    u16 unkA;
    struct LevelObject unkC[1];
    u8 filler10[0x400C-0x10];
    u16 unk400C[0x1000];
    u16 unk600C[0x1000];
    u16 unk800C[0x2000];
    u32 unkC00C;
};

enum SpriteID  // Index of sprites in gUncompressedGraphicsTable
{
    SPRITE_ID_DK_WORLD_INTRO  = 241,

    SPRITE_ID_MARIO_STAND     = 727,
    SPRITE_ID_MARIO_RUN       = 737,
	
    SPRITE_ID_MOVIE_ONE       = 892,
    SPRITE_ID_MOVIE_TWO       = 893,
    SPRITE_ID_MOVIE_THREE     = 894,
    SPRITE_ID_MOVIE_CREDITS_1 = 895,
    SPRITE_ID_MOVIE_FIVE      = 896,
    SPRITE_ID_MOVIE_SIX       = 897,
    SPRITE_ID_MOVIE_SEVEN     = 898,
    SPRITE_ID_MOVIE_CREDITS_2 = 899,
    SPRITE_ID_MOVIE_UNUSED    = 900,
    SPRITE_ID_MOVIE_UNUSED_2  = 901,
};

struct UnknownStruct13
{
    //u8 filler0[4];
    u32 unk0;
    u32 unk4;
};

struct UnknownStruct11
{
    u8 filler0[0x1000];
    u32 unk1000;
    u8 filler1004;
    struct UnknownStruct13 *unk1008;
};

struct UnknownStruct12
{
    u8 unk0_0:3;
    u8 unk0_3:2;
    u8 unk0_5:1;
};

enum LevelType
{
    LEVEL_TYPE_MAIN,
    LEVEL_TYPE_PLUS,
    LEVEL_TYPE_EXPERT_1_6,
    LEVEL_TYPE_EXPERT_7_12,
    LEVEL_TYPE_MAIN_BOSS,
    LEVEL_TYPE_PLUS_BOSS,
};

struct SubSpriteTemplate
{
    /*0x00*/ u8 index;  // index into sprite sheet?
    /*0x01*/ u8 duration;  // Anim frame duration
    /*0x02*/ s8 x_offset;  // x offset from sprite position
    /*0x03*/ s8 y_offset;  // y offset from sprite position
    /*0x04*/ u32 unk4;  // unknown/unused
    u32 unk8;  // some kind of flags?
    void *unkC;
    //u8 filler10[0x24-0x10];
    u8 filler10[0x1A-0x10];
    u16 unk1A;
    u16 unk1C;
    u16 unk1E;
    u16 unk20;
    u8 filler22[0x24-0x22];
};

struct SpriteTemplate
{
    /*0x00*/ u16 x;  // might actually be the number of subsprites instead?
    /*0x02*/ u16 y;
    u16 unk4;
    u16 unk6;  // number of tiles used? not sure...
    /*0x08*/ u16 subSpriteSize;  // size of each sprite's tile data
    /*0x0C*/ struct SubSpriteTemplate *subSprites;
    /*0x10*/ struct OamData *oamData;  // oam
    /*0x14*/ u8 *tileData;  // tile data
};  // size = 0x18

// header to some data
// full size is unkB * gUnknown_03000170.unk18
struct SomeUnknownHeader
{
    u8 filler0[0xB];
    u8 unkB;
    u8 unkC;
};

// header for UnknownListThing2 and StructC40_child
struct LinkedListHeaderMaybe
{
    u32 unk0;
    union
    {
        u32 as_u32;
        struct
        {
            u8 unk0;
            u16 unk2;
        } as_struct;
    } unk4;
    struct LinkedListHeaderMaybe *unk8;
};  // size = 0xC

struct LinkedListHeaderMaybe_alt  // should be LinkedListHeaderMaybe?
{
    s32 unk0;
    union
    {
        u32 as_u32;
        struct
        {
            u8 unk0;
            u16 unk2;
        } as_struct;
    } unk4;
    struct LinkedListHeaderMaybe *unk8;
};  // size = 0xC

struct UnknownListThing1
{
    struct LinkedListHeaderMaybe header;
    u8 unkC;
};  // size = 0x10

struct UnknownListThing2
{
    struct LinkedListHeaderMaybe header;
    void *unkC;
};  // size = 0x10

struct Struct170_sub
{
    struct SomeUnknownHeader *unk0;
    struct SomeUnknownHeader *unk4;  // next one after unk0
};  // size = 0x8

struct Struct170
{
    struct Struct170_sub unk0[3];
    u32 unk18;  // size of something
    struct LinkedListHeaderMaybe *unk1C;  // array of 12 LinkedListHeaderMaybe structs
    s32 unk20;
};

struct StructC30
{
    u32 unk0;
    struct UnknownListThing2 *unk4;
};

struct StructC40_sub
{
    void *unk0;
    u8 *unk4;
};

struct StructC40
{
    struct StructC40_sub unk0[1];
    u8 filler0[4];
    u8 fillerC[0x18-0xC];
    u32 unk18;
    u32 unk1C;
    struct LinkedListHeaderMaybe *unk20;  // array
};

struct StructC70
{
    void *unk0;
    u32 unk4;
    void *unk8;
    void *unkC;
    u8 filler10[0x4];
    void *unk14;
    u32 unk18;
};

struct StructC90_child14
{
    u32 unk0;
    u32 unk4;
    u8 filler8[4];
    u16 unkC;
    u8 fillerE[2];
};  // size = 0x10

struct StructC90
{
    /*0x00*/ void *copyDest;
    /*0x04*/ void *copySrc;
    u16 unk8;
    /*0x0A*/ u16 copyLength;
    void *unkC[2];
    struct StructC90_child14 *unk14;
    /*0x18*/ void (*armFunc)(struct StructC90 *, struct StructC70 *, void *, int);  // pointer to some ARM function loaded into RAM
};

struct Struct0802C1C0
{
    u8 filler0[8];
    /*0x08*/ void *bgPalSrc;
    /*0x0C*/ void *objPalSrc;
    u8 filler10[2];
    u16 unk12;
};

struct StructCB0_child
{
    void (*unk0)(struct Struct0802C1C0 *);
    u8 unk4;
    struct StructCB0_child *unk8;
    /*0x0C*/ struct StructCB0_child *next;
    struct Struct0802C1C0 *unk10;
};

struct StructCB0
{
    struct StructCB0_child unk0[5];
    u32 unk64;  // count of unk0 structs
    struct StructCB0_child *unk68;
    struct StructCB0_child *unk6C;
};

struct StructD20
{
    void *unk0[1][2];
    void *unk8;
    void *unkC;
    u16 unk10;
    u16 unk12;
};

struct StructD78
{
    s32 unk0;
    s32 unk4;
    s16 unk8;
    s16 unkA;
    u16 unkC;
    u16 unkE;
    u8 unk10[0x18-0x10];
};  // size = 0x18

struct StructD7C
{
    u8 filler0[0x20];
    s32 unk20;
    s32 unk24;
    u8 filler28[0xB0-0x28];
};  // size = 0xB0

struct Struct802C31C
{
    u32 unk0;
    u32 unk4;
};  // size = 0x8

struct Struct08078210_sub
{
    u16 unk0;
    u16 unk2;
    u8 unk4;
};

struct Struct168
{
    u16 unk0;
    u16 unk2;
    u16 unk4;
    u16 unk6;
};

enum PaletteID
{
    PALETTE_0_TITLE_SCREEN,
    PALETTE_1_MAIN_MENU,
    PALETTE_2_EXPERT_LEVELS,
    PALETTE_3_OPTIONS_MENU,
    PALETTE_4,
