#define INCLUDED_FROM_SAVEFILE_C
#include "gba/gba.h"
#include "global.h"
#include "main.h"

struct LevelStats
{
    /*0x00*/ u16 highScore;
    /*0x02*/ u8 filler2[2];
    /*0x04*/ u8 present1;  // got red present
    /*0x05*/ u8 present2;  // got yellow present
    /*0x06*/ u8 present3;  // got blue present
    /*0x07*/ u8 flags;  // bits 0-3: mini mario count (for MM level) or lives remaining (for DK level)
                        // bit 6: got high score, bit 7: completed
};

// bit flags for LevelStats.flags
#define LEVEL_FLAG_COMPLETE  0x80
#define LEVEL_FLAG_HIGHSCORE 0x40  // highscore

// Confusingly, a different set of flags is used by the "get_level_stats" functions
#define LEVEL_STAT_COLLECTED_ALL 0x40
#define LEVEL_STAT_HIGHSCORE     0x80

struct SaveFile
{
    /*0x000*/ s8 lives;
    u8 unk1;
    u8 unk2;
    u8 unk3;
    s32 unk4;
    /*0x008*/ u8 stars;  // number of stars obtained
    /*0x009*/ u8 levelsCompleted;  // number of main and plus levels completed
    /*0x00C*/ struct LevelStats mainLevels[6 * 8];  // 6 worlds, 8 levels per world
    /*0x18C*/ struct LevelStats plusLevels[6 * 8];  // 6 worlds, 7 levels per world (the 8th slot in each world is unused
    /*0x30C*/ struct LevelStats mainBossLevel;
    /*0x314*/ struct LevelStats plusBossLevel;
    /*0x31C*/ struct LevelStats expertLevels1_6[6];
    /*0x34C*/ struct LevelStats expertLevels7_12[6];
};  // 0x37C

// Returns the last unlocked level for a main or plus world. This is the first
// level that has not yet been completed. If the world has not been unlocked,
// returns -1 instead.
s8 get_last_unlocked_level_for_world(u8 levelType, u8 world)
{
    struct SaveFile *saveFile = &gSaveFilesPtr[*gSelectedSaveFileNumPtr];
    u8 level;

    if (levelType == LEVEL_TYPE_MAIN)
    {
        if (world > 0 && !is_world_or_expert_level_completed_080103C8(0, world - 1))
            return -1;
        for (level = 0; level < 8; level++)
        {
            if (!(saveFile->mainLevels[world * 8 + level].flags & LEVEL_FLAG_COMPLETE))
                break;
        }
        return level;
    }
    else if (levelType == LEVEL_TYPE_PLUS)
    {
        if (world > 0 && !is_world_or_expert_level_completed_080103C8(1, world - 1))
            return -1;
        for (level = 0; level < 7; level++)
        {
