#define INCLUDED_FROM_SAVEFILE_C
#include "gba/gba.h"
#include "global.h"
#include "main.h"

#define LEVEL_COMPLETED 0x80
#define LEVEL_STARRED   0x40

struct LevelStats
{
    /*0x00*/ u16 highScore;
    /*0x02*/ u8 filler2[2];
    /*0x04*/ u8 present1;  // presents
    /*0x05*/ u8 present2;
    /*0x06*/ u8 present3;
    /*0x07*/ u8 flags;  // upper nibble: flags, lower nibble: mini mario count
};

struct SaveFile
{
    s8 lives;
    u8 unk1;
    u8 unk2;
    u8 unk3;
    s32 unk4;
    u8 unk8;
    u8 unk9;
    /*0x0C*/ struct LevelStats mainLevels[48];
    /*0x18C*/ struct LevelStats plusLevels[46];
    u8 filler2FC[0x30C-0x2FC];
    u16 unk30C;
    u8 filler30E[0x313-0x30E];
    u8 unk313;
    u16 unk314;
    u8 filler316[0x31B-0x316];
    u8 unk31B;
    struct LevelStats unk31C[6];
    struct LevelStats unk34C[6];
};  // 0x37C

enum LevelCategory
{
    MAIN_LEVELS = 0,
    PLUS_LEVELS = 1,
};

s8 sub_0800F76C(u8 arg0, u8 world)
{
    struct SaveFile *saveFile = &gSaveFilesPtr[*gSelectedSaveFileNumPtr];
    u8 level;

    if (arg0 == 0)
    {
        if (world != 0 && sub_080103C8(0, world - 1) == 0)
            return -1;
        for (level = 0; level < 8; level++)
        {
            if (!(saveFile->mainLevels[world * 8 + level].flags & LEVEL_COMPLETED))
                break;
        }
        return level;
    }
    else if (arg0 == 1)
    {
        if (world != 0 && sub_080103C8(1, world - 1) == 0)
            return -1;
        for (level = 0; level < 7; level++)
        {
