#include "gba/gba.h"
#include "global.h"

struct MusicPattern  // pattern?
{
    u32 length;  // length of pattern in ticks
    u32 offset;  // offset to note data from beginning of file
};

struct MusicFile
{
    u8 filler0[0x34];  // name
    u16 unk34;  // number of patterns?
    u16 unk36;
    u16 unk38;
    u16 unk3A;
    u8 filler3C[0x3E - 0x3C];
    /*0x03E*/ u16 tickLength;
    u16 unk40;
    u8 filler42[2];
    /*0x044*/ u8 patternOrder[0x144-0x44];
    /*0x144*/ s16 instrumentIDs[(0x244-0x144)/2];
    u8 unk244[16][2];
    u8 filler264[0x284-0x264];
    /*0x284*/ struct MusicPattern patterns[1];
};

struct SoundWork_sub3
{
    u8 unk0;
    u8 unk1;
    u8 unk2;
    u8 unk3;
    u32 unk4;
    u32 unk8;
    u32 unkC;  // sample rate
    /*0x10*/ struct SoundEffect *soundEffect;
};

struct SoundBuffers
{
    u8 sndBufA[0x120];
    u8 sndBufB[0x120];
};

struct Struct08072750
{
    //u16 unk0[0][2];
    struct { u16 unk0, unk2; } unk0[0];
    u8 filler0[0x30];
    u8 unk30;
    u8 unk31;
    u8 filler32[0x33-0x32];
    u8 unk33;
    u8 unk34;
    u8 unk35;
    u16 unk36[1];  // TODO: extend
};

static_assert(sizeof(struct Struct08072750) == 0x38, size38);

struct Instrument_sub
{
    u8 filler0[0xC];
    u8 unkC;
    u8 unkD;
    u8 unkE;
    u8 fillerF;
    u8 unk10;
    s8 unk11;
    u8 filler12[0x28-0x12];  // name?
    u8 unk28;
    u8 filler29[0x30-0x29];
};

struct Instrument  // size = 0x13C?
{
    char name[0x10];
    u8 unk10;
    u8 filler11[0x16-0x11];
    u8 unk16;
    u8 unk17;
    u8 filler18[0x1B-0x18];
    u8 unk1B[0x94-0x1B];
    struct Struct08072750 unk94;
    u8 fillerCC[0xE4-0xCC];
    struct Struct08072750 unkE4;
    u8 filler11C[0x134-0x11C];
    u16 unk134;
    u8 filler136[2];
    struct Instrument_sub *unk138;
};

static_assert(offsetof(struct Instrument, unk138) == 0x138, offset138);

extern struct Instrument gInstruments[];

struct MusicChannel_sub
{
    u16 unk0;
    u8 unk2;
    u16 unk4;
};

// Music voice/channel?
struct MusicChannel
{
    struct MusicChannel_sub unk0;
    struct MusicChannel_sub unk8;
    /*0x10*/ u8 currNote;
    /*0x11*/ u8 prevNote;
    /*0x12*/ u8 instrumentIndex;
    u8 unk13;
    u8 unk14;
    u8 unk15;
    u8 unk16;
    u8 unk17;
    u8 unk18;
    u8 unk19;
    u8 unk1A;
    u8 unk1B;
    s8 unk1C;
    u8 unk1D;
    u16 unk1E;
    u32 unk20;
    s8 unk24;
    /*0x25*/ u8 prevHdrByte;
    s16 unk26;
    s16 unk28;
    s16 unk2A;
    s8 unk2C;
    s8 unk2D;
    s8 unk2E;
    s8 unk2F;
    u16 unk30;
    u16 unk32;
    u8 unk34[1];  // array?
    u8 unk35;
    u8 unk36;
    u8 unk37;
    u8 unk38;
    u8 unk39;
    u8 unk3A;
    u8 unk3B;
    /*0x3C*/ struct Instrument *instrument;
    struct Instrument_sub *unk40;
    u8 unk44;
    u8 unk45;
    u16 unk46;
    s16 unk48;
    s16 unk4A;
};

struct SoundWork_sub2
{
    struct MusicFile *unk0;  // data of currently playing song
    struct MusicChannel channels[16];
    struct MusicChannel *unk4C4[8];
    /*0x4E4*/ u8 *noteDataPtr;  // ptr to note data?
    /*0x4E8*/ s16 volume;
    s16 unk4EA;
    /*0x4EC*/ s16 tickLength;
    u16 unk4EE;
    s16 unk4F0;
    /*0x4F2*/ s16 unk4F2;
    u16 unk4F4;
    /*0x4F6*/ s16 currPatternTick;
    /*0x4F8*/ s16 unk4F8;
    u8 unk4FA;
    u8 unk4FB;
    u32 unk4FC;
    u32 unk500;
    u32 unk504;
    s32 unk508;
    s32 unk50C;
    u8 unk510[1];
};  // unknown size

struct SoundWork
{
    u8 unk0;
    u8 unk1;
    /*0x02*/ u8 updateTimer;  // timer until next buffer reload?
    u8 unk3;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unk7;
    u8 unk8;
    u32 unkC;
    struct SoundBuffers unk10[2];
    u8 filler490[0x6D0-0x490];
    u8 unk6D0[0xB50-0x6D0];
    /*0xB50*/ u8 codeBuf1[0xE8];  // ARM code buffer
    /*0xC38*/ u8 codeBuf2[0x390];  // ARM code buffer
    struct SoundWork_sub2 unkFC8;  // music state?
    u8 filler14C4[0x14DC-0xFC8-sizeof(struct SoundWork_sub2)];
    struct SoundWork_sub3 unk14DC[1];  // variable length (by unk0) sound effect state?
};

void sub_080728F0(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08072A04(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08072A88(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08072B10(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08072BA8(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08072C74(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08072D54(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08072E64(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08072F2C(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_0807394C(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_080739B0(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08073A34(struct MusicChannel *arg0, void *arg1, int arg2);
void sub_08073AAC(struct MusicChannel *arg0, void *arg1, int arg2);

u16 gUnknown_08B3961C[] =
{
    16726, 16741, 16756, 16771, 16786, 16801, 16816, 16832,
    16847, 16862, 16877, 16892, 16908, 16923, 16938, 16953,
    16969, 16984, 16999, 17015, 17030, 17046, 17061, 17076,
    17092, 17107, 17123, 17138, 17154, 17169, 17185, 17200,
    17216, 17231, 17247, 17262, 17278, 17293, 17309, 17325,
    17340, 17356, 17372, 17387, 17403, 17419, 17435, 17450,
    17466, 17482, 17498, 17513, 17529, 17545, 17561, 17577,
    17593, 17608, 17624, 17640, 17656, 17672, 17688, 17704,
    17720, 17736, 17752, 17768, 17784, 17800, 17816, 17832,
    17848, 17865, 17881, 17897, 17913, 17929, 17945, 17962,
    17978, 17994, 18010, 18027, 18043, 18059, 18075, 18092,
    18108, 18124, 18141, 18157, 18174, 18190, 18206, 18223,
    18239, 18256, 18272, 18289, 18305, 18322, 18338, 18355,
    18372, 18388, 18405, 18421, 18438, 18455, 18471, 18488,
    18505, 18521, 18538, 18555, 18572, 18588, 18605, 18622,
    18639, 18656, 18672, 18689, 18706, 18723, 18740, 18757,
    18774, 18791, 18808, 18825, 18842, 18859, 18876, 18893,
    18910, 18927, 18944, 18961, 18978, 18995, 19013, 19030,
    19047, 19064, 19081, 19099, 19116, 19133, 19150, 19168,
    19185, 19202, 19220, 19237, 19254, 19272, 19289, 19306,
    19324, 19341, 19359, 19376, 19394, 19411, 19429, 19446,
    19464, 19482, 19499, 19517, 19534, 19552, 19570, 19587,
    19605, 19623, 19640, 19658, 19676, 19694, 19711, 19729,
    19747, 19765, 19783, 19801, 19819, 19836, 19854, 19872,
    19890, 19908, 19926, 19944, 19962, 19980, 19998, 20016,
    20034, 20052, 20071, 20089, 20107, 20125, 20143, 20161,
    20179, 20198, 20216, 20234, 20252, 20271, 20289, 20307,
    20326, 20344, 20362, 20381, 20399, 20418, 20436, 20455,
    20473, 20492, 20510, 20529, 20547, 20566, 20584, 20603,
    20621, 20640, 20659, 20677, 20696, 20715, 20733, 20752,
    20771, 20790, 20808, 20827, 20846, 20865, 20884, 20902,
    20921, 20940, 20959, 20978, 20997, 21016, 21035, 21054,
    21073, 21092, 21111, 21130, 21149, 21168, 21187, 21206,
    21226, 21245, 21264, 21283, 21302, 21322, 21341, 21360,
    21379, 21399, 21418, 21437, 21457, 21476, 21496, 21515,
    21534, 21554, 21573, 21593, 21612, 21632, 21651, 21671,
    21690, 21710, 21730, 21749, 21769, 21789, 21808, 21828,
    21848, 21867, 21887, 21907, 21927, 21946, 21966, 21986,
    22006, 22026, 22046, 22066, 22086, 22105, 22125, 22145,
    22165, 22185, 22205, 22226, 22246, 22266, 22286, 22306,
    22326, 22346, 22366, 22387, 22407, 22427, 22447, 22468,
    22488, 22508, 22528, 22549, 22569, 22590, 22610, 22630,
    22651, 22671, 22692, 22712, 22733, 22753, 22774, 22794,
    22815, 22836, 22856, 22877, 22897, 22918, 22939, 22960,
    22980, 23001, 23022, 23043, 23063, 23084, 23105, 23126,
    23147, 23168, 23189, 23210, 23230, 23251, 23272, 23293,
    23315, 23336, 23357, 23378, 23399, 23420, 23441, 23462,
    23483, 23505, 23526, 23547, 23568, 23590, 23611, 23632,
    23654, 23675, 23696, 23718, 23739, 23761, 23782, 23804,
    23825, 23847, 23868, 23890, 23911, 23933, 23954, 23976,
    23998, 24019, 24041, 24063, 24084, 24106, 24128, 24150,
    24172, 24193, 24215, 24237, 24259, 24281, 24303, 24325,
    24347, 24369, 24391, 24413, 24435, 24457, 24479, 24501,
    24523, 24545, 24567, 24590, 24612, 24634, 24656, 24679,
    24701, 24723, 24746, 24768, 24790, 24813, 24835, 24857,
    24880, 24902, 24925, 24947, 24970, 24992, 25015, 25038,
    25060, 25083, 25105, 25128, 25151, 25174, 25196, 25219,
    25242, 25265, 25287, 25310, 25333, 25356, 25379, 25402,
    25425, 25448, 25471, 25494, 25517, 25540, 25563, 25586,
    25609, 25632, 25655, 25678, 25702, 25725, 25748, 25771,
    25795, 25818, 25841, 25864, 25888, 25911, 25935, 25958,
    25981, 26005, 26028, 26052, 26075, 26099, 26123, 26146,
    26170, 26193, 26217, 26241, 26264, 26288, 26312, 26336,
    26359, 26383, 26407, 26431, 26455, 26479, 26502, 26526,
    26550, 26574, 26598, 26622, 26646, 26670, 26695, 26719,
    26743, 26767, 26791, 26815, 26839, 26864, 26888, 26912,
    26937, 26961, 26985, 27010, 27034, 27058, 27083, 27107,
    27132, 27156, 27181, 27205, 27230, 27254, 27279, 27304,
    27328, 27353, 27378, 27402, 27427, 27452, 27477, 27502,
    27526, 27551, 27576, 27601, 27626, 27651, 27676, 27701,
    27726, 27751, 27776, 27801, 27826, 27851, 27876, 27902,
    27927, 27952, 27977, 28003, 28028, 28053, 28078, 28104,
    28129, 28155, 28180, 28205, 28231, 28256, 28282, 28307,
    28333, 28359, 28384, 28410, 28435, 28461, 28487, 28513,
    28538, 28564, 28590, 28616, 28642, 28667, 28693, 28719,
    28745, 28771, 28797, 28823, 28849, 28875, 28901, 28927,
    28953, 28980, 29006, 29032, 29058, 29084, 29111, 29137,
    29163, 29190, 29216, 29242, 29269, 29295, 29322, 29348,
    29375, 29401, 29428, 29454, 29481, 29507, 29534, 29561,
    29587, 29614, 29641, 29668, 29694, 29721, 29748, 29775,
    29802, 29829, 29856, 29883, 29910, 29937, 29964, 29991,
    30018, 30045, 30072, 30099, 30126, 30154, 30181, 30208,
    30235, 30263, 30290, 30317, 30345, 30372, 30400, 30427,
    30454, 30482, 30509, 30537, 30565, 30592, 30620, 30647,
    30675, 30703, 30731, 30758, 30786, 30814, 30842, 30870,
    30897, 30925, 30953, 30981, 31009, 31037, 31065, 31093,
    31121, 31149, 31178, 31206, 31234, 31262, 31290, 31319,
    31347, 31375, 31403, 31432, 31460, 31489, 31517, 31546,
    31574, 31602, 31631, 31660, 31688, 31717, 31745, 31774,
    31803, 31832, 31860, 31889, 31918, 31947, 31975, 32004,
    32033, 32062, 32091, 32120, 32149, 32178, 32207, 32236,
    32265, 32295, 32324, 32353, 32382, 32411, 32441, 32470,
    32499, 32529, 32558, 32587, 32617, 32646, 32676, 32705,
    32735, 32764, 32794, 32823, 32853, 32883, 32912, 32942,
    32972, 33002, 33031, 33061, 33091, 33121, 33151, 33181,
    33211, 33241, 33271, 33301, 33331, 33361, 33391, 33421,
};

s32 gUnknown_08B39C1C[][64] =
{
    {
             0,   6423,  12785,  19023,  25079,  30893,  36409,  41575,
         46341,  50659,  54491,  57797,  60547,  62714,  64277,  65220,
         65536,  65220,  64277,  62714,  60547,  57797,  54491,  50659,
         46341,  41575,  36409,  30893,  25079,  19023,  12785,   6423,
             0,  -6423, -12785, -19023, -25079, -30893, -36409, -41575,
        -46341, -50659, -54491, -57797, -60547, -62714, -64277, -65220,
        -65536, -65220, -64277, -62714, -60547, -57797, -54491, -50659,
        -46341, -41575, -36409, -30893, -25079, -19023, -12785,  -6423,
    },
    {
         65536,  65536,  65536,  65536,  65536,  65536,  65536,  65536,
         65536,  65536,  65536,  65536,  65536,  65536,  65536,  65536,
         65536,  65536,  65536,  65536,  65536,  65536,  65536,  65536,
         65536,  65536,  65536,  65536,  65536,  65536,  65536,  65536,
        -65536, -65536, -65536, -65536, -65536, -65536, -65536, -65536,
        -65536, -65536, -65536, -65536, -65536, -65536, -65536, -65536,
        -65536, -65536, -65536, -65536, -65536, -65536, -65536, -65536,
        -65536, -65536, -65536, -65536, -65536, -65536, -65536, -65536,
    },
    {
             0,   2048,   4096,   6144,   8192,  10240,  12288,  14336,
         16384,  18432,  20480,  22528,  24576,  26624,  28672,  30720,
         32768,  34816,  36864,  38912,  40960,  43008,  45056,  47104,
         49152,  51200,  53248,  55296,  57344,  59392,  61440,  -2048,
        -63488, -61440, -59392, -57344, -55296, -53248, -51200, -49152,
        -47104, -45056, -43008, -40960, -38912, -36864, -34816, -32768,
        -30720, -28672, -26624, -24576, -22528, -20480, -18432, -16384,
        -14336, -12288, -10240,  -8192,  -6144,  -4096,  -2048,      0,
    },
};

u8 gUnknown_08B39F1C[] =
{
    8,
    0,
    1,
    2,
    3,
    8,
    8,
    5,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    6,
    8,
    8,
    7,
    4,
    8,
    8,
    0,
    0,
    0,
};

u32 gUnknown_08B39F48[] =
{
    0x000,
    0x100,
    0x200,
    0x001,
    0x101,
    0x201,
    0x002,
    0x102,
    0x202,
    0x003,
    0x103,
    0x203,
    0x004,
    0x104,
    0x204,
    0x005,
    0x105,
    0x205,
    0x006,
    0x106,
    0x206,
    0x007,
    0x107,
    0x207,
    0x008,
    0x108,
    0x208,
    0x009,
    0x109,
    0x209,
    0x00A,
};

u32 gUnknown_08B39FC4[] =
{
    0x000,
    0x040,
    0x080,
    0x0C0,
    0x100,
    0x140,
    0x180,
    0x1C0,
    0x200,
    0x240,
    0x280,
    0x2C0,
    0x300,
    0x340,
    0x380,
    0x3C0,
};

// effect functions?
void (*gUnknown_08B3A004[])(struct MusicChannel *, void *, int) =
{
    sub_080728F0,
    sub_08072A04,
    sub_08072A88,
    sub_08072B10,
    sub_08072BA8,
    sub_08072C74,
    sub_08072D54,
    sub_08072E64,
    sub_0807394C,
    sub_0807394C,
    sub_08072F2C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_0807394C,
    sub_080739B0,
    sub_0807394C,
    sub_0807394C,
    sub_08073A34,
    sub_08073AAC,
    sub_0807394C,
    sub_0807394C,
};

u16 gUnknown_08B3A0A8[] =
{
      0,   1,   3,   5,   7,   9,  11,  13,
     15,  17,  19,  21,  22,  24,  26,  28,
     30,  31,  33,  35,  36,  38,  40,  41,
     43,  45,  46,  48,  49,  51,  52,  54,
     56,  57,  58,  60,  61,  63,  64,  66,
     67,  68,  70,  71,  72,  74,  75,  76,
     78,  79,  80,  81,  82,  84,  85,  86,
     87,  88,  89,  90,  91,  92,  93,  94,
     96,  96,  97,  98,  99, 100, 101, 102,
    103, 104, 105, 106, 106, 107, 108, 109,
    110, 110, 111, 112, 112, 113, 114, 114,
    115, 116, 116, 117, 117, 118, 118, 119,
    120, 120, 120, 121, 121, 122, 122, 123,
    123, 123, 124, 124, 124, 125, 125, 125,
    126, 126, 126, 126, 126, 127, 127, 127,
    127, 127, 127, 127, 127, 127, 127, 127,
    128, 129, 130, 131, 132, 133, 134, 135,
    136, 137, 138, 139, 140, 141, 142, 143,
    144, 145, 146, 147, 148, 149, 150, 151,
    152, 153, 154, 155, 156, 157, 158, 159,
    160, 161, 162, 163, 164, 165, 166, 167,
    168, 169, 170, 171, 172, 173, 174, 175,
    176, 177, 178, 179, 180, 181, 182, 183,
    184, 185, 186, 187, 188, 189, 190, 191,
    192, 193, 194, 195, 196, 197, 198, 199,
    200, 201, 202, 203, 204, 205, 206, 207,
    208, 209, 210, 211, 212, 213, 214, 215,
    216, 217, 218, 219, 220, 221, 222, 223,
    224, 225, 226, 227, 228, 229, 230, 231,
    232, 233, 234, 235, 236, 237, 238, 239,
    240, 241, 242, 243, 244, 245, 246, 247,
    248, 249, 250, 251, 252, 253, 254, 255,
    256, 257, 258, 259, 260, 261, 262, 263,
    264, 265, 266, 267, 268, 269, 270, 271,
    272, 273, 274, 275, 276, 277, 278, 279,
    280, 281, 282, 283, 284, 285, 286, 287,
    288, 289, 290, 291, 292, 293, 294, 295,
    296, 297, 298, 299, 300, 301, 302, 303,
    304, 305, 306, 307, 308, 309, 310, 311,
    312, 313, 314, 315, 316, 317, 318, 319,
    320, 321, 322, 323, 324, 325, 326, 327,
    328, 329, 330, 331, 332, 333, 334, 335,
    336, 337, 338, 339, 340, 341, 342, 343,
    344, 345, 346, 347, 348, 349, 350, 351,
    352, 353, 354, 355, 356, 357, 358, 359,
    360, 361, 362, 363, 364, 365, 366, 367,
    368, 369, 370, 371, 372, 373, 374, 375,
    376, 377, 378, 379, 380, 381, 382, 383,
    384, 385, 386, 387, 388, 389, 390, 391,
    392, 393, 394, 395, 396, 397, 398, 399,
    400, 401, 402, 403, 404, 405, 406, 407,
    408, 409, 410, 411, 412, 413, 414, 415,
    416, 417, 418, 419, 420, 421, 422, 423,
    424, 425, 426, 427, 428, 429, 430, 431,
    432, 433, 434, 435, 436, 437, 438, 439,
    440, 441, 442, 443, 444, 445, 446, 447,
    448, 449, 450, 451, 452, 453, 454, 455,
    456, 457, 458, 459, 460, 461, 462, 463,
    464, 465, 466, 467, 468, 469, 470, 471,
    472, 473, 474, 475, 476, 477, 478, 479,
    480, 481, 482, 483, 484, 485, 486, 487,
    488, 489, 490, 491, 492, 493, 494, 495,
    496, 497, 498, 499, 500, 501, 502, 503,
    504, 505, 506, 507, 508, 509, 510, 511,
    512,   0,
};

struct Struct08B3A4AC
{
    /*0x00*/ volatile u16 *lenEnvReg;
    /*0x04*/ volatile u16 *freqReg;
    u16 unk8;
    u16 unused;
};

struct Struct08B3A4AC gUnknown_08B3A4AC[] =
{
    { &REG_SOUND1CNT_H, &REG_SOUND1CNT_X, 0xF800, 0x07FF },
    { &REG_SOUND2CNT_L, &REG_SOUND2CNT_H, 0xF800, 0x07FF },
    { &REG_SOUND3CNT_H, &REG_SOUND3CNT_X, 0xF800, 0x07FF },
    { &REG_SOUND4CNT_L, &REG_SOUND4CNT_H, 0xFFFF, 0x0000 },
};

// ARM code
extern u8 sound_arm_1_start[];
extern u8 arm_update_sound_dma_transfer[];
extern u8 arm_load_sound_16bit_to_8bit[];
extern u8 sound_arm_2_start[];
extern u8 sub_08001968[];

extern void (*ptr_arm_clear_audio_buffer)(void *, int);
extern void (*gUnknown_03001EE4)();
extern void (*ptr_arm_update_sound_dma_transfer)(void);
extern void (*ptr_arm_load_sound_16bit_to_8bit)();
extern void (*gUnknown_03001EFC)();
extern u32 gUnknown_03001F00;
extern u32 gUnknown_03001F04;
extern u32 gUnknown_03001F08;
extern struct SoundWork *gSoundWork;

void sub_080714B8(struct SoundWork_sub3 *arg0, void *arg1, int arg2);
