#include "gba/gba.h"
#include "global.h"
#include "sound.h"

struct MusicPattern  // pattern?
{
    u32 length;  // length of pattern in ticks
    u32 offset;  // offset to note data from beginning of file
};

struct MusicFile
{
    u8 filler0[0x34];  // name
    /*0x034*/ u16 songLength;  // length of patternOrder table
    /*0x036*/ u16 loopStart;  // loop start point (index into patternOrder array)
    u16 unk38;
    u16 unk3A;
    u8 filler3C[0x3E - 0x3C];
    /*0x03E*/ u16 tickLength;
    u16 unk40;
    u8 filler42[2];
    /*0x044*/ u8 patternOrder[0x144-0x44];
    /*0x144*/ s16 instrumentIDs[(0x244-0x144)/2];
    u8 unk244[16][2];
    u8 filler264[0x284-0x264];
    /*0x284*/ struct MusicPattern patterns[1];
};

struct SoundPlayer
{
    u8 unk0;
    /*0x01*/ u8 pan;
    /*0x02*/ u8 unk2;
    /*0x03*/ u8 volume;
    /*0x04*/ u32 uid;  // unique ID of sound playing instance
    /*0x08*/ u32 position;  // current byte offset within sound (14 fractional bits)
    /*0x0C*/ u32 sampleDelta;  // delta between samples (14 fractional bits)
    /*0x10*/ struct SoundEffect *soundEffect;
};

struct SoundBuffers
{
    s8 sndBufA[0x120];
    s8 sndBufB[0x120];
};

struct Struct08072750
{
    struct { u16 unk0, unk2; } unk0[12];
    u8 unk30;
    u8 unk31;
    u8 filler32[0x33-0x32];
    u8 unk33;
    u8 unk34;
    u8 unk35;
    u16 unk36[12];
};

struct InstrumentSound
{
    u8 filler0[0xC];
    u8 unkC;
    u8 unkD;
    u8 unkE;
    u8 fillerF;
    u8 unk10;
    s8 unk11;
    u8 filler12[0x28-0x12];  // name?
    u8 unk28;
    u8 filler29[1];
    /*0x2C*/ s16 *samplePtr;  // sample data
};

struct Instrument  // size = 0x13C?
{
    char name[0xC];
    u8 fillerC[4];
    u8 unk10;
    u8 filler11[0x16-0x11];
    u8 unk16;
    u8 unk17;
    u8 filler18[0x1B-0x18];
    /*0x121*/ u8 noteToSoundMap[121];  // note to sound mapping
    struct Struct08072750 unk94;
    struct Struct08072750 unkE4;
    u16 unk134;
    u8 filler136[2];
    /*0x138*/ struct InstrumentSound *sounds;
};

static_assert(offsetof(struct Instrument, unk134) == 0x134, Instrument_unk134);
static_assert(offsetof(struct Instrument, sounds) == 0x138, Instrument_unk138);

extern struct Instrument gInstruments[];

struct MusicChannel_sub
{
    u16 unk0;
    u8 unk2;
    u16 unk4;
};

// Music voice/channel?
struct MusicChannel
{
    struct MusicChannel_sub unk0;
    struct MusicChannel_sub unk8;
    /*0x10*/ u8 currNote;
    /*0x11*/ u8 prevNote;
    /*0x12*/ u8 currInstrIndex;
    /*0x13*/ u8 prevInstrIndex;
    /*0x14*/ u8 currVolume;  // volume?
    u8 unk15;
    u8 unk16;
    u8 unk17;
    /*0x18*/ u8 currEffect;
    /*0x19*/ u8 prevEffect;
    /*0x1A*/ u8 currEffectParam;
    /*0x1B*/ u8 prevEffectParam;
    s8 unk1C;
    u8 unk1D;
    u16 unk1E;
    u32 unk20;
    s8 unk24;
    /*0x25*/ u8 prevHdrByte;
    s16 unk26;
    s16 unk28;
    /*0x2A*/ s16 pitchRelated;  // something related to pitch?
    s8 unk2C;
    s8 unk2D;  // pan?
    s8 unk2E;
    s8 unk2F;
    u16 unk30;
    u16 unk32;
    u8 unk34[1];  // array?
    u8 unk35;
    u8 unk36;
    u8 unk37;
    u8 unk38;
    u8 unk39;
    u8 unk3A;
    u8 unk3B;
    /*0x3C*/ struct Instrument *instrument;
    /*0x40*/ struct InstrumentSound *instrSound;  // sound for currently playing note
    u8 unk44;
    u8 unk45;
    u16 unk46;
    s16 unk48;
    s16 unk4A;
};

struct MusicPlayer
{
    struct MusicFile *musicFile;  // data of currently playing song
    struct MusicChannel channels[16];
    struct MusicChannel *unk4C4[8];
    /*0x4E4*/ u8 *noteDataPtr;  // ptr to note data?
    /*0x4E8*/ s16 volume;
    s16 unk4EA;
    /*0x4EC*/ s16 tickLength;
    /*0x4EE*/ u16 loopFlag;  // music loops if bit 0 is set
    s16 unk4F0;
    /*0x4F2*/ s16 currPatternIndex;
    u16 unk4F4;
    /*0x4F6*/ s16 currPatternTick;
    /*0x4F8*/ s16 unk4F8;
    u8 unk4FA;
    u8 unk4FB;
    u32 unk4FC;  // bitmask of used channels?
    u32 unk500;
    u32 unk504;
    s32 unk508;
    s32 unk50C;  // length of current note (in samples)?
    u8 unk510[3];
};  // unknown size

struct SoundWork
{
    /*0x00*/ u8 soundPlayersCount;
    u8 unk1;
    /*0x02*/ u8 updateTimer;  // timer until next buffer reload?
    u8 unk3;
    u8 unk4;
    u8 unk5;
    u8 unk6;
    u8 unk7;
    u8 unk8;
    u32 unkC;
    struct SoundBuffers unk10[2];
    u8 filler490[0x6D0-0x490];
    /*0x6D0*/ s16 unk6D0[0x240];  // some sound buffer?
    /*0xB50*/ u8 codeBuf1[0xE8];  // ARM code buffer
    /*0xC38*/ u8 codeBuf2[0x390];  // ARM code buffer
    /*0xFC8*/ struct MusicPlayer musicPlayer;  // music state?
    /*0x14DC*/ struct SoundPlayer soundPlayers[1];  // variable length (by soundPlayersCount) sound effect state?
};

static void effect_0_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_1_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_2_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_3_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_4_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_5_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_6_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_7_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_10_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_default_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_34_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_37_func(struct MusicChannel *chan, s16 *dest, int numSamples);
static void effect_38_func(struct MusicChannel *chan, s16 *dest, int numSamples);

u16 gFrequencyLUT_08B3961C[768] =
{
    16726, 16741, 16756, 16771, 16786, 16801, 16816, 16832,
    16847, 16862, 16877, 16892, 16908, 16923, 16938, 16953,
    16969, 16984, 16999, 17015, 17030, 17046, 17061, 17076,
    17092, 17107, 17123, 17138, 17154, 17169, 17185, 17200,
    17216, 17231, 17247, 17262, 17278, 17293, 17309, 17325,
    17340, 17356, 17372, 17387, 17403, 17419, 17435, 17450,
    17466, 17482, 17498, 17513, 17529, 17545, 17561, 17577,
    17593, 17608, 17624, 17640, 17656, 17672, 17688, 17704,
    17720, 17736, 17752, 17768, 17784, 17800, 17816, 17832,
    17848, 17865, 17881, 17897, 17913, 17929, 17945, 17962,
    17978, 17994, 18010, 18027, 18043, 18059, 18075, 18092,
    18108, 18124, 18141, 18157, 18174, 18190, 18206, 18223,
    18239, 18256, 18272, 18289, 18305, 18322, 18338, 18355,
    18372, 18388, 18405, 18421, 18438, 18455, 18471, 18488,
    18505, 18521, 18538, 18555, 18572, 18588, 18605, 18622,
    18639, 18656, 18672, 18689, 18706, 18723, 18740, 18757,
    18774, 18791, 18808, 18825, 18842, 18859, 18876, 18893,
    18910, 18927, 18944, 18961, 18978, 18995, 19013, 19030,
    19047, 19064, 19081, 19099, 19116, 19133, 19150, 19168,
    19185, 19202, 19220, 19237, 19254, 19272, 19289, 19306,
    19324, 19341, 19359, 19376, 19394, 19411, 19429, 19446,
    19464, 19482, 19499, 19517, 19534, 19552, 19570, 19587,
    19605, 19623, 19640, 19658, 19676, 19694, 19711, 19729,
    19747, 19765, 19783, 19801, 19819, 19836, 19854, 19872,
    19890, 19908, 19926, 19944, 19962, 19980, 19998, 20016,
    20034, 20052, 20071, 20089, 20107, 20125, 20143, 20161,
    20179, 20198, 20216, 20234, 20252, 20271, 20289, 20307,
    20326, 20344, 20362, 20381, 20399, 20418, 20436, 20455,
    20473, 20492, 20510, 20529, 20547, 20566, 20584, 20603,
    20621, 20640, 20659, 20677, 20696, 20715, 20733, 20752,
    20771, 20790, 20808, 20827, 20846, 20865, 20884, 20902,
    20921, 20940, 20959, 20978, 20997, 21016, 21035, 21054,
    21073, 21092, 21111, 21130, 21149, 21168, 21187, 21206,
    21226, 21245, 21264, 21283, 21302, 21322, 21341, 21360,
    21379, 21399, 21418, 21437, 21457, 21476, 21496, 21515,
    21534, 21554, 21573, 21593, 21612, 21632, 21651, 21671,
    21690, 21710, 21730, 21749, 21769, 21789, 21808, 21828,
    21848, 21867, 21887, 21907, 21927, 21946, 21966, 21986,
    22006, 22026, 22046, 22066, 22086, 22105, 22125, 22145,
    22165, 22185, 22205, 22226, 22246, 22266, 22286, 22306,
    22326, 22346, 22366, 22387, 22407, 22427, 22447, 22468,
    22488, 22508, 22528, 22549, 22569, 22590, 22610, 22630,
    22651, 22671, 22692, 22712, 22733, 22753, 22774, 22794,
    22815, 22836, 22856, 22877, 22897, 22918, 22939, 22960,
    22980, 23001, 23022, 23043, 23063, 23084, 23105, 23126,
    23147, 23168, 23189, 23210, 23230, 23251, 23272, 23293,
    23315, 23336, 23357, 23378, 23399, 23420, 23441, 23462,
    23483, 23505, 23526, 23547, 23568, 23590, 23611, 23632,
    23654, 23675, 23696, 23718, 23739, 23761, 23782, 23804,
    23825, 23847, 23868, 23890, 23911, 23933, 23954, 23976,
    23998, 24019, 24041, 24063, 24084, 24106, 24128, 24150,
    24172, 24193, 24215, 24237, 24259, 24281, 24303, 24325,
    24347, 24369, 24391, 24413, 24435, 24457, 24479, 24501,
    24523, 24545, 24567, 24590, 24612, 24634, 24656, 24679,
    24701, 24723, 24746, 24768, 24790, 24813, 24835, 24857,
    24880, 24902, 24925, 24947, 24970, 24992, 25015, 25038,
    25060, 25083, 25105, 25128, 25151, 25174, 25196, 25219,
    25242, 25265, 25287, 25310, 25333, 25356, 25379, 25402,
    25425, 25448, 25471, 25494, 25517, 25540, 25563, 25586,
    25609, 25632, 25655, 25678, 25702, 25725, 25748, 25771,
    25795, 25818, 25841, 25864, 25888, 25911, 25935, 25958,
    25981, 26005, 26028, 26052, 26075, 26099, 26123, 26146,
    26170, 26193, 26217, 26241, 26264, 26288, 26312, 26336,
    26359, 26383, 26407, 26431, 26455, 26479, 26502, 26526,
    26550, 26574, 26598, 26622, 26646, 26670, 26695, 26719,
    26743, 26767, 26791, 26815, 26839, 26864, 26888, 26912,
    26937, 26961, 26985, 27010, 27034, 27058, 27083, 27107,
    27132, 27156, 27181, 27205, 27230, 27254, 27279, 27304,
    27328, 27353, 27378, 27402, 27427, 27452, 27477, 27502,
    27526, 27551, 27576, 27601, 27626, 27651, 27676, 27701,
    27726, 27751, 27776, 27801, 27826, 27851, 27876, 27902,
    27927, 27952, 27977, 28003, 28028, 28053, 28078, 28104,
    28129, 28155, 28180, 28205, 28231, 28256, 28282, 28307,
    28333, 28359, 28384, 28410, 28435, 28461, 28487, 28513,
    28538, 28564, 28590, 28616, 28642, 28667, 28693, 28719,
    28745, 28771, 28797, 28823, 28849, 28875, 28901, 28927,
    28953, 28980, 29006, 29032, 29058, 29084, 29111, 29137,
    29163, 29190, 29216, 29242, 29269, 29295, 29322, 29348,
    29375, 29401, 29428, 29454, 29481, 29507, 29534, 29561,
    29587, 29614, 29641, 29668, 29694, 29721, 29748, 29775,
    29802, 29829, 29856, 29883, 29910, 29937, 29964, 29991,
    30018, 30045, 30072, 30099, 30126, 30154, 30181, 30208,
    30235, 30263, 30290, 30317, 30345, 30372, 30400, 30427,
    30454, 30482, 30509, 30537, 30565, 30592, 30620, 30647,
    30675, 30703, 30731, 30758, 30786, 30814, 30842, 30870,
    30897, 30925, 30953, 30981, 31009, 31037, 31065, 31093,
    31121, 31149, 31178, 31206, 31234, 31262, 31290, 31319,
    31347, 31375, 31403, 31432, 31460, 31489, 31517, 31546,
    31574, 31602, 31631, 31660, 31688, 31717, 31745, 31774,
    31803, 31832, 31860, 31889, 31918, 31947, 31975, 32004,
    32033, 32062, 32091, 32120, 32149, 32178, 32207, 32236,
    32265, 32295, 32324, 32353, 32382, 32411, 32441, 32470,
    32499, 32529, 32558, 32587, 32617, 32646, 32676, 32705,
    32735, 32764, 32794, 32823, 32853, 32883, 32912, 32942,
    32972, 33002, 33031, 33061, 33091, 33121, 33151, 33181,
    33211, 33241, 33271, 33301, 33331, 33361, 33391, 33421,
};

s32 gUnknown_08B39C1C[][64] =
{
    {
             0,   6423,  12785,  19023,  25079,  30893,  36409,  41575,
         46341,  50659,  54491,  57797,  60547,  62714,  64277,  65220,
         65536,  65220,  64277,  62714,  60547,  57797,  54491,  50659,
         46341,  41575,  36409,  30893,  25079,  19023,  12785,   6423,
             0,  -6423, -12785, -19023, -25079, -30893, -36409, -41575,
        -46341, -50659, -54491, -57797, -60547, -62714, -64277, -65220,
        -65536, -65220, -64277, -62714, -60547, -57797, -54491, -50659,
        -46341, -41575, -36409, -30893, -25079, -19023, -12785,  -6423,
    },
    {
         65536,  65536,  65536,  65536,  65536,  65536,  65536,  65536,
         65536,  65536,  65536,  65536,  65536,  65536,  65536,  65536,
         65536,  65536,  65536,  65536,  65536,  65536,  65536,  65536,
         65536,  65536,  65536,  65536,  65536,  65536,  65536,  65536,
        -65536, -65536, -65536, -65536, -65536, -65536, -65536, -65536,
        -65536, -65536, -65536, -65536, -65536, -65536, -65536, -65536,
        -65536, -65536, -65536, -65536, -65536, -65536, -65536, -65536,
        -65536, -65536, -65536, -65536, -65536, -65536, -65536, -65536,
    },
    {
             0,   2048,   4096,   6144,   8192,  10240,  12288,  14336,
         16384,  18432,  20480,  22528,  24576,  26624,  28672,  30720,
         32768,  34816,  36864,  38912,  40960,  43008,  45056,  47104,
         49152,  51200,  53248,  55296,  57344,  59392,  61440,  -2048,
        -63488, -61440, -59392, -57344, -55296, -53248, -51200, -49152,
        -47104, -45056, -43008, -40960, -38912, -36864, -34816, -32768,
        -30720, -28672, -26624, -24576, -22528, -20480, -18432, -16384,
        -14336, -12288, -10240,  -8192,  -6144,  -4096,  -2048,      0,
    },
};

static u8 gUnknown_08B39F1C[] =
{
    8,
    0,
    1,
    2,
    3,
    8,
    8,
    5,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    8,
    6,
    8,
    8,
    7,
    4,
    8,
    8,
    0,
    0,
    0,
};

u32 gUnknown_08B39F48[] =
{
    0x000,
    0x100,
    0x200,
    0x001,
    0x101,
    0x201,
    0x002,
    0x102,
    0x202,
    0x003,
    0x103,
    0x203,
    0x004,
    0x104,
    0x204,
    0x005,
    0x105,
    0x205,
    0x006,
    0x106,
    0x206,
    0x007,
    0x107,
    0x207,
    0x008,
    0x108,
    0x208,
    0x009,
    0x109,
    0x209,
    0x00A,
};

// No idea why this needs a lookup table
static u32 sTimes64LUT[] =
{
    64*0,
    64*1,
    64*2,
    64*3,
    64*4,
    64*5,
    64*6,
    64*7,
    64*8,
    64*9,
    64*10,
    64*11,
    64*12,
    64*13,
    64*14,
    64*15,
};

// effect functions?
static void (*sEffectFuncs[])(struct MusicChannel *chan, s16 *dest, int numSamples) =
{
    effect_0_func,
    effect_1_func,
    effect_2_func,
    effect_3_func,
    effect_4_func,
    effect_5_func,
    effect_6_func,
    effect_7_func,
    effect_default_func,
    effect_default_func,
    effect_10_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_default_func,
    effect_34_func,
    effect_default_func,
    effect_default_func,
    effect_37_func,
    effect_38_func,
    effect_default_func,
    effect_default_func,
};

// Some kind of lookup table for adjusting volume
u16 gVolumeAdjustTable[513] =
{
#define X(n) (n >= 128 ? n : (n*2.0f - n*n/128.0f))
    X(0),   X(1),   X(2),   X(3),   X(4),   X(5),   X(6),   X(7),   X(8),   X(9), 
    X(10),  X(11),  X(12),  X(13),  X(14),  X(15),  X(16),  X(17),  X(18),  X(19), 
    X(20),  X(21),  X(22),  X(23),  X(24),  X(25),  X(26),  X(27),  X(28),  X(29), 
    X(30),  X(31),  X(32),  X(33),  X(34),  X(35),  X(36),  X(37),  X(38),  X(39), 
    X(40),  X(41),  X(42),  X(43),  X(44),  X(45),  X(46),  X(47),  X(48),  X(49), 
    X(50),  X(51),  X(52),  X(53),  X(54),  X(55),  X(56),  X(57),  X(58),  X(59), 
    X(60),  X(61),  X(62),  X(63),  X(64),  X(65),  X(66),  X(67),  X(68),  X(69), 
    X(70),  X(71),  X(72),  X(73),  X(74),  X(75),  X(76),  X(77),  X(78),  X(79), 
    X(80),  X(81),  X(82),  X(83),  X(84),  X(85),  X(86),  X(87),  X(88),  X(89), 
    X(90),  X(91),  X(92),  X(93),  X(94),  X(95),  X(96),  X(97),  X(98),  X(99), 
    X(100), X(101), X(102), X(103), X(104), X(105), X(106), X(107), X(108), X(109), 
    X(110), X(111), X(112), X(113), X(114), X(115), X(116), X(117), X(118), X(119), 
    X(120), X(121), X(122), X(123), X(124), X(125), X(126), X(127), X(128), X(129), 
    X(130), X(131), X(132), X(133), X(134), X(135), X(136), X(137), X(138), X(139), 
    X(140), X(141), X(142), X(143), X(144), X(145), X(146), X(147), X(148), X(149), 
    X(150), X(151), X(152), X(153), X(154), X(155), X(156), X(157), X(158), X(159), 
    X(160), X(161), X(162), X(163), X(164), X(165), X(166), X(167), X(168), X(169), 
    X(170), X(171), X(172), X(173), X(174), X(175), X(176), X(177), X(178), X(179), 
    X(180), X(181), X(182), X(183), X(184), X(185), X(186), X(187), X(188), X(189), 
    X(190), X(191), X(192), X(193), X(194), X(195), X(196), X(197), X(198), X(199), 
    X(200), X(201), X(202), X(203), X(204), X(205), X(206), X(207), X(208), X(209), 
    X(210), X(211), X(212), X(213), X(214), X(215), X(216), X(217), X(218), X(219), 
    X(220), X(221), X(222), X(223), X(224), X(225), X(226), X(227), X(228), X(229), 
    X(230), X(231), X(232), X(233), X(234), X(235), X(236), X(237), X(238), X(239), 
    X(240), X(241), X(242), X(243), X(244), X(245), X(246), X(247), X(248), X(249), 
    X(250), X(251), X(252), X(253), X(254), X(255), X(256), X(257), X(258), X(259), 
    X(260), X(261), X(262), X(263), X(264), X(265), X(266), X(267), X(268), X(269), 
    X(270), X(271), X(272), X(273), X(274), X(275), X(276), X(277), X(278), X(279), 
    X(280), X(281), X(282), X(283), X(284), X(285), X(286), X(287), X(288), X(289), 
    X(290), X(291), X(292), X(293), X(294), X(295), X(296), X(297), X(298), X(299), 
    X(300), X(301), X(302), X(303), X(304), X(305), X(306), X(307), X(308), X(309), 
    X(310), X(311), X(312), X(313), X(314), X(315), X(316), X(317), X(318), X(319), 
    X(320), X(321), X(322), X(323), X(324), X(325), X(326), X(327), X(328), X(329), 
    X(330), X(331), X(332), X(333), X(334), X(335), X(336), X(337), X(338), X(339), 
    X(340), X(341), X(342), X(343), X(344), X(345), X(346), X(347), X(348), X(349), 
    X(350), X(351), X(352), X(353), X(354), X(355), X(356), X(357), X(358), X(359), 
    X(360), X(361), X(362), X(363), X(364), X(365), X(366), X(367), X(368), X(369), 
    X(370), X(371), X(372), X(373), X(374), X(375), X(376), X(377), X(378), X(379), 
    X(380), X(381), X(382), X(383), X(384), X(385), X(386), X(387), X(388), X(389), 
    X(390), X(391), X(392), X(393), X(394), X(395), X(396), X(397), X(398), X(399), 
    X(400), X(401), X(402), X(403), X(404), X(405), X(406), X(407), X(408), X(409), 
    X(410), X(411), X(412), X(413), X(414), X(415), X(416), X(417), X(418), X(419), 
    X(420), X(421), X(422), X(423), X(424), X(425), X(426), X(427), X(428), X(429), 
    X(430), X(431), X(432), X(433), X(434), X(435), X(436), X(437), X(438), X(439), 
    X(440), X(441), X(442), X(443), X(444), X(445), X(446), X(447), X(448), X(449), 
    X(450), X(451), X(452), X(453), X(454), X(455), X(456), X(457), X(458), X(459), 
    X(460), X(461), X(462), X(463), X(464), X(465), X(466), X(467), X(468), X(469), 
    X(470), X(471), X(472), X(473), X(474), X(475), X(476), X(477), X(478), X(479), 
    X(480), X(481), X(482), X(483), X(484), X(485), X(486), X(487), X(488), X(489), 
    X(490), X(491), X(492), X(493), X(494), X(495), X(496), X(497), X(498), X(499), 
    X(500), X(501), X(502), X(503), X(504), X(505), X(506), X(507), X(508), X(509), 
    X(510), X(511), X(512),
#undef X
};

struct Struct08B3A4AC
{
    /*0x00*/ volatile u16 *lenEnvReg;
    /*0x04*/ volatile u16 *freqReg;
    u16 unk8;
    u16 unused;
};

static struct Struct08B3A4AC sGBCSoundRegDefs[] =
{
    { &REG_SOUND1CNT_H, &REG_SOUND1CNT_X, 0xF800, 0x07FF },
    { &REG_SOUND2CNT_L, &REG_SOUND2CNT_H, 0xF800, 0x07FF },
    { &REG_SOUND3CNT_H, &REG_SOUND3CNT_X, 0xF800, 0x07FF },
    { &REG_SOUND4CNT_L, &REG_SOUND4CNT_H, 0xFFFF, 0x0000 },
};

struct Struct080714B8
{
    s16 *buffer;
    void *samplePtr;
    u32 position;  // current position? 14 fractional bits
    u32 sampleDelta;  // delta between samples? 14 fractional bits
    u32 unk10;
    u32 unk14;
    u32 unk18;
    u32 leftVol;
    u32 rightVol;
};

// ARM code
extern u8 sound_arm_1_start[];
extern u8 arm_update_sound_dma_transfer[];
extern u8 arm_load_sound_16bit_to_8bit[];
extern u8 sound_arm_2_start[];
extern u8 arm_mix_music_note[];

static void (*ptr_arm_clear_audio_buffer)(void *, int);
static void (*ptr_arm_mix_wave_sound)(struct Struct080714B8 *);
